[
  {
    "name": "Allison Martinez-Arocho",
    "email": "alli.arocho@gmail.com",
    "avatar": "https://secure.gravatar.com/avatar/4f6190093874d85fa6003967216190d7?s=500",
    "location": "Unknown",
    "bio": "Allison is a software engineer with the Partner Experience Team at IBM in Durham, NC, where she develops internal and external applications that help shape the experience of IBM Digital Marketplace users. She earned a B.S. in Computer Science with minors in Mathematics, Statistics, and Marketing from Meredith College in Raleigh, NC. Prior to beginning at IBM, she was a computer science education researcher at North Carolina State University, where she helped design and develop a video game to teach middle school students about computing and Big Data. She was also part of the Scratch Development team at the MIT Media Lab. In her spare time, she enjoys creative endeavors in and around textiles, wearable computing, and comic-strip writing. She is originally from Toa Baja, Puerto Rico and is a lover of coffee, musicals, and rollerskating.",
    "twitter": "vamoavel",
    "url": "",
    "organization": "IBM",
    "shirt_size": "Women's M",
    "title": "Data-Driven Generative Art Using Processing.py",
    "abstract": "This workshop will serve as an introduction and hands-on exploration of computational creativity. Attendees will use APIs and real-time data to create a unique work of art by using Processing and Python.",
    "description": "This workshop is for people who would like to explore artistic expression through the use of a programming language, or people who are interested in creative forms of data visualization. By the end of this workshop you will have created data-driven, generative art using Python. In this workshop, you will learn how to: use Processing in Python mode, identify APIs that provide useful data for creating generative art, and create a unique work of art by calling a weather API and defining an original generative art algorithm. Please bring a laptop to participate in the hands-on activities.",
    "notes": "I have many passions; among them are programming, art, and teaching. I will jump at any opportunity to share these passions with people, and PyCaribbean seems like the perfect venue for this workshop. I can't wait to go back home and talk about the things I love, in a place I love.\r\n\r\nFor this workshop, I will need at least the following things:\r\n-Internet Access\r\n-Projector\r\n-Power outlets for attendees",
    "audience_level": "All",
    "tag_list": [],
    "rating": 0.0
  },
  {
    "name": "Mariatta Wijaya",
    "email": "mariatta.wijaya@gmail.com",
    "avatar": "https://secure.gravatar.com/avatar/6b6e72d297aa0270654a0d4575f1287e?s=500",
    "location": "Vancouver, Canada",
    "bio": "Mariatta Wijaya works as a Software Engineer in Vancouver, Canada. She contributes to Python.org, CPython, and coala.io and helps organize Vancouver Pyladies. She has film credits for Hotel Transylvania 2, The Angry Birds Movie, and Storks.",
    "twitter": "mariatta",
    "url": "",
    "organization": "Python, PyLadies",
    "shirt_size": "Women's XL",
    "title": "Dial M For Mentor",
    "abstract": "One of the nicest things about Python community is the availability of mentors willing to help you. Finding a mentor is not as easy as it seems, and it takes a lot of courage to reach out in the first place. \nI will provide advice about working with a mentor.\nAsking for help is not a failure. ",
    "description": "One of the nicest things about Python community is the availability of mentors willing to help you. Various mentors have helped me navigate the open source community and help advanced my skills. I realized finding a mentor is not as easy as it seems, and it takes a lot of courage to reach out in the first place. And then, there is impostor syndrome, where one may feel like they don’t deserve the help.\r\nIn this talk, I will provide advice about working with a mentor.\r\nAsking for help is not a failure. \r\n\r\n\r\nThis talk is for members of Python and open source community who are looking for a mentor, and needing clues as to how to find a good mentor. Those who are hesitant to ask for help may get the encouragement to reach out. Current mentors will gain insight about what their mentees are going through.",
    "notes": "Outlines\r\n------------\r\n\r\n\r\nMyths to debunk: (5-10 minutes)\r\n==========================\r\n\r\n1. “I don’t deserve their help/I’m not worthy”\r\n    * Impostor Syndrome. Men and women alike can experience this. \r\n    * First, admit that this is a problem, then help yourself.\r\n    * Provide links to other talks/resources which discuss Impostor Syndrome\r\n2. “I’m wasting their time”\r\n    * Mentors learn from you too. Your work may expose them to areas they haven’t been before. \r\n    * Mentors gain skills: leadership, communication, and time management. Self-improvement for the win!\r\n    * Sometimes it’s nice to have solvable problems to work on. “Experts” have challenging days of their own full of uncertainty and confusion. Being able to help and having answers to your questions can be a rewarding experience. \r\n3. “I’m a failure for needing help”\r\n    * Quoting Erik Romijn, “Asking for help is not the same as failure”. Refer to his talk: “Healthy Minds in Healthy Community”\r\n4. “I know so little, I don’t even know what questions to ask”\r\n    * It’s part of learning. You will reach the point where you don’t need help anymore.\r\n\r\nWhy work with a mentor (5 minutes)\r\n==============================\t\r\n\r\n\r\n1. Maybe you’ve been stuck for a long time\r\n2. Maybe you tried it on your own, and not successful.\r\n3.  Maybe you’re experienced in one domain, but want to learn new skills\r\n    * Eg: You’re experienced in Python, and want to start picking up Javascript/Go/C\r\n   * Mentors have gone through your problems. They can help and provide guidance\r\n4. But it’s up to you to reach out in the first place. Don’t believe in myths.\r\n5. Personal experience:\r\n    * Making more progress when working with mentor, compared to when trying to achieve things on my own. I feel indebted, and it gives me more motivation to succeed.\r\n\r\n\r\nWhere to find mentors (3 minutes) \r\n============================\r\n1. Face to face / in person:\r\n    * Someone within your own organization/company/school\r\n    * Someone in your local python community/meetup\r\n2. Online mentorship:\r\n    * Pyladies, Python Core Mentorship\r\n    * IRC or Slack channels\r\n3. Conference speaker mentors \r\n\r\n\r\nWorking with your mentor (5 minutes) \r\n================================\r\n1. It’s two-way, requires commitment from both sides\r\n2. Respect each other. Your mentor has other commitments and personal life\r\n3. If it doesn’t work out for any reason, find a different mentor.\r\n4. Want to thank your mentor? Pay it forward. Mentor others.\r\n\r\nTruth about mentorship (3 minutes)\r\n==============================\r\n1. Mentor plays a supporting role. They provide resources and advice needed to succeed. But they won’t be doing your homework.\r\n2. You are the real star of the show, you learn and do all the real work.\r\n3. Don't forget to take credit for your own work and effort.\r\n\r\nThanks!\r\n\r\n\r\nMore about myself:\r\nI contribute to python, cpython, and coala.io.\r\nMy github is: https://github.com/mariatta\r\nI chronicled my contributions to python and cpython in this timeline:\r\nhttps://mariatta.github.io/mariatta\r\n\r\n\r\nPast speaking experiences:\r\nDjangoCon 2016\r\nvideo: https://www.youtube.com/watch?v=QgwUvaNjlRM\r\nslides: https://docs.google.com/presentation/d/1UZidG0oPsfV5YpqnAq7vOfEA8lfqyBEDFYyJCVSInZ0/edit?usp=sharing\r\nVancouver Python Day 2016, video: https://vimeo.com/170384416\r\nI also have an IMDb profile http://www.imdb.com/name/nm7641957/",
    "audience_level": "All",
    "tag_list": [
      "softskills",
      "mentorship",
      "community"
    ],
    "rating": 0.0
  },
  {
    "name": "Tracy Osborn",
    "email": "tracy@limedaring.com",
    "avatar": "https://secure.gravatar.com/avatar/55486de8dc13fc5996a34cd2d4cbfd85?s=500",
    "location": "Nomad",
    "bio": "Tracy Osborn is a designer, developer, and entreprenerd living in Toronto, Canada. She’s the author of Hello Web App and the upcoming Hello Web Design, as well as the creator of WeddingLovely. She's also an avid outdoorswoman and would love to go on a hike with you.\r\n",
    "twitter": "limedaring",
    "url": "http://limedaring.com",
    "organization": "Limedaring",
    "shirt_size": "Women's M",
    "title": "Marketing for Developers",
    "abstract": "\"If you build it, they will come,\" they say. Not so! Marketing is crucial for anything you build that you want people to find and use. How should you market your app, or your open-source project, or your mobile app, or anything else you build — especially as a time-strapped developer? ",
    "description": "Marketing is tough but crucial. It sucks when you build something awesome but no one uses it. How do you get the word out? How do you find users? This talk will go over marketing in general and what developers can do to make sure they market their apps without taking up too much of their time (or feeling too smarmy).\r\n\r\nOutline:\r\n\r\n* Introduction\r\n\r\n* Marketing overview\r\n\r\n  * What is marketing and why should we do it?\r\n\r\n* Marketing tactics for developers\r\n\r\n  * Keeping track of your analytics\r\n\r\n  * Being smart about what you spend your time on\r\n\r\n  * Using the right words and content \r\n\r\n  * Finding relevant communities\r\n\r\n  * Using social media\r\n\r\n  * Overview on email lists\r\n\r\n  * Marketing tactics that don't work\r\n\r\n  * Very brief overview of paid advertising\r\n\r\n* Resources\r\n\r\n* Conclusion",
    "notes": "I’ve written a few books aimed at learning how to code: http://hellowebapp.com\r\n\r\nI’ve spoken at quite a few other conferences: http://lanyrd.com/profile/limedaring/\r\n\r\nMy keynote at O’Reilly’s Fluent: https://www.youtube.com/watch?v=IyHTYmSYJz8",
    "audience_level": "All",
    "tag_list": [
      "marketing",
      "web"
    ],
    "rating": 0.0
  },
  {
    "name": "Andrii Soldatenko",
    "email": "andrii.soldatenko@gmail.com",
    "avatar": "https://secure.gravatar.com/avatar/ef0c06e2a6d8c2da5dd07ebbdf20f451?s=500",
    "location": "Ukaraine",
    "bio": "My name is Andrii Soldatenko and I like testing and programming. I’m CTO in Ethoos. Also I’m working as Senior Python Backend Developer via toptal under social network.\r\nI boast expertise as a Python and Golang developer with strong hard and soft skills. I have deep knowledge of automated-testing and really understands how to assess and improve project quality. I like to solve difficult tasks, algorithms and take part in sport programming contests. I’m also interested in databases and unix based operating systems and has fallen in love with natural language processing and text mining.",
    "twitter": "a_soldatenko",
    "url": "https://asoldatenko.com/",
    "organization": "Toptal",
    "shirt_size": "Men's L",
    "title": "Building social network with Neo4j and Python",
    "abstract": "Social phenomena is coming. We have lot’s of social applications that we are using every day. Lot’s of apps based on social graph and graph theory. We will discuss how to work with graphs and build Social network using python and Graph databases. We’ll compare SQL and NoSQL approaches.",
    "description": "Social phenomena is coming. We have lot’s of social applications that we are using every day, let’s say Facebook, twitter, instagram. Lot’s of such kind apps based on social graph and graph theory. I would like to share my knowledge and expertise about how to work with graphs and build large social graph as engine for Social network using python and Graph databases. We’ll compare SQL and NoSQL approaches for friends relationships.",
    "notes": "",
    "audience_level": "Intermediate",
    "tag_list": [],
    "rating": 0.0
  },
  {
    "name": "George Koodarappally",
    "email": "gjkood@yahoo.com",
    "avatar": "https://secure.gravatar.com/avatar/9229b6a6632c605ec776db97a48d64d1?s=500",
    "location": "Unknown",
    "bio": "I am a hobbyist dabbling in the world of IoT. Over the past 6 months I have become fascinated with the Espressif ESP8266 and ESP32 family of WiFi chipsets. In my day job I provide corporations with enterprise solutions while in my spare time I indulge in minor hacking with microprocessor boards such as the Arduino, Raspberry Pi, Adafruit Feather, Sparkfun Thing, etc. Python has made working with these devices much more easier than having to learn the deep intricasies of the C/C++ tool chains otherwise needed.\r\n\r\nThe Internet-of-Things (IoT) has piqued my interest and I have been diving deep into the various components of such solutions.\r\n",
    "twitter": "spicecoaster",
    "url": "http://spicecoaster.wordpress.com",
    "organization": "",
    "shirt_size": "Men's XL",
    "title": "A Beginners Guide to IoT Using ESP8266 and MicroPython",
    "abstract": "Everybody is talking about Internet-of-Things (IoT) these days. Have you wondered what this is all about and how you can get involved? I would like to take you through my journey to experimenting with IoT using MicroPython and the relatively new ESP8266/ESP32 WiFi integrated microprocessor boards.",
    "description": "The purpose of this talk is to introduce the audience to a sampling of the various components that go into an **Inernet-of-Things (IoT)** solution. We delve into an example that uses an embedded microprossor board containing the **ESP8266 WiFi** chipset running **MicroPython**, which is interfaced to a few sensors. We also introduce the audience to the use of the **MQTT** protocol and the use of a **MQTT Message Broker**.\r\n\r\nThe example demonstrates the connection of a **remote embedded processor to a local WiFi access point**, connection to an **MQTT Message Broker** through an **MQTT client** library, **capture of data from connected sensors** and the subsequent **upload of the measured data** to a server using the MQTT messaging protocol.\r\n",
    "notes": "The example solution used in this talk has the following **technical requirements**:\r\n\r\n**Hardware**: Embedded Microprocessor Board (**Adafruit Feather HUZZAH with ESP8266 WiFi**), Sensors (**Temperature/Humidity Sensor**, possibly others) and Communications (**WiFi Router/Access Point**).\r\n\r\n**Software**: Embedded Software (**MicroPython ESP8266 Edition**), MQTT Client (**umqtt-simple**), MQTT Broker (**RabbitMQ w/MQTT plugin**) and a simple custom developed IoT data collection server.\r\n\r\nThis talk is given from a **Beginner to IoT** point of view and is a series of steps taken to implement a sample solution in the IoT space. I am definitely not an expert on this topic but would like to present what a beginner to this topic would have to understand in order to progress further. The **steps and missteps** that I make during the development of this sample solution are a **valuable reference** to those who would like to dip their toes into this new and fast developing area.\r\n",
    "audience_level": "All",
    "tag_list": [
      "experimental",
      "micropython",
      "iot",
      "esp8266",
      "mqtt"
    ],
    "rating": 0.0
  },
  {
    "name": "Trey Hunner",
    "email": "trey@truthful.technology",
    "avatar": "https://secure.gravatar.com/avatar/93a988bd85040f58f8417dc4be78c7de?s=500",
    "location": "San Diego, CA",
    "bio": "",
    "twitter": "treyhunner",
    "url": "http://treyhunner.com",
    "organization": "Truthful Technology, LLC",
    "shirt_size": "Men's L",
    "title": "Readability Counts",
    "abstract": "During this talk we'll learn a number of techniques for refactoring code to improve readability and maintainability.  We'll end with a checklist for improving the readability of your own code.",
    "description": "If you've ever found unreadable PEP8-compliant code and wondered how to fix it, this talk is for you.\r\n\r\nLong-lived code must be maintainable and readability is a prerequisite of maintainability.  It's easier to identify unreadable code than it is to create readable code.\r\n\r\nLet's talk about how to create readable code.\r\n\r\nDuring this talk we'll discuss:\r\n\r\n- whitespace\r\n- self-documenting code\r\n- modularity\r\n- expectation management\r\n\r\nWe'll conclude this talk with a checklist of questions you can use to make your own code more readable.",
    "notes": "Code style is my passion. I've learned my own code style practices from through constructive criticism on pull requests to Python and Django projects. I authored a language-agnostic code linter called EditorConfig and I've contributed to the pycodestyle Python linter tool.\r\n\r\nI gave a variation of this talk at DjangoCon 2016. Slides here: http://treyhunner.com/readability-counts/",
    "audience_level": "All",
    "tag_list": [],
    "rating": 0.0
  },
  {
    "name": "Kim Crayton",
    "email": "kmcrayton7@yahoo.com",
    "avatar": "https://secure.gravatar.com/avatar/757dbff2728d60d50976c772e7e689f4?s=500",
    "location": "United States",
    "bio": "​Kim has years of experience working with learners of all ages, skill level, and abilities and she would like to offer what she knows about successful mentorship to her new community. Kim is the author of the \"Tech Talk For Non-Techies\" blog and is currently pursuing a Doctors of Business Administration - Technology Entrepreneurship. Kim is working on her passion project JrDevMentoring.com and has been consulting with various bootcamps since speaking at ScotlandJS 2016. \r\n",
    "twitter": "KimCrayton1",
    "url": "http://www.techtalkfornontechies.com/",
    "organization": "Kim Crayton LLC",
    "shirt_size": "Men's S",
    "title": "​ Overcoming the Challenges of Mentoring",
    "abstract": "Successful mentoring doesn’t just happen, it’s planned. Let’s talk about what mentoring is, what it is not, and what makes for an effective mentorship.",
    "description": "​There is an ongoing mantra within the developer community: that there are far more jobs available then programmers to fill them. Which should be an indication as to the wonderful potential for both business and those learning to code. Yet what often follows such statements are not words of joy but rather a list of frustrations related to the difficulty in finding and retaining enough skilled developers to fill these positions. \r\nThe challenge is not in the number of newbies entering the field but the number who leave because they are not able to bridge the divide between bootcamps, online tutorials, books, videos, etc. to an employable developer who is able to contribute to the team. \r\nKim has years of experience working with learners of various ages in helping them develop the skills they needed to be successful at whatever their chosen goal. She understands that for businesses to be successful, they must develop more effective and efficient ways of recruiting and retaining developers in order to meet organizational benchmarks. \r\nThe developer community is a overwhelmingly generous one and a well designed mentoring or apprenticeship program could be one answer that business leaders and newbies are looking for.\r\n\r\n- The business costs associated with corporate hiring managers inability to recruit and retain skilled workers to fill current and future entry-level positions are increasing (Queen, 2014). \r\n- 89 percent of organizational leaders stated that they are having difficulties filling open positions, which is causing them to either turn down orders, miss key deliverable deadlines or hire individuals from outside of the United States (Aho, 2015). \r\n\r\nAho, K. (2015). The robotics industry: creating jobs, closing the skills gap. Techniques, (7), 22. Retrieved from https://www.acteonline.org/techniques/#.VpMcQq6rR0s\r\n\r\nQueen, J. (2014). Hire power: to close the skills gap, states are teaming up with industries that need, but can't find, qualified workers. State Legislatures, (8), 16. Retrieved from http://www.ncsl.org/bookstore/state-legislatures-magazine.aspx",
    "notes": "Talk ​Details:\r\n1. ​Understanding that there is a difference between personal/professional mentoring and youth/adult mentoring.\r\n2. A clarification of what mentoring is not.\r\n3. An explanation of what mentoring is.\r\n4. A review of factors for effective mentoring for both mentor and mentee.\r\n5. Reasons the development community could benefit from a planned mentoring approach.\r\n6. Several personally designed activities to engage audience participation (depending on the session time-frame)",
    "audience_level": "All",
    "tag_list": [],
    "rating": 0.0
  },
  {
    "name": "Andrii Soldatenko",
    "email": "andrii.soldatenko@gmail.com",
    "avatar": "https://secure.gravatar.com/avatar/ef0c06e2a6d8c2da5dd07ebbdf20f451?s=500",
    "location": "Ukaraine",
    "bio": "My name is Andrii Soldatenko and I like testing and programming. I’m CTO in Ethoos. Also I’m working as Senior Python Backend Developer via toptal under social network.\r\nI boast expertise as a Python and Golang developer with strong hard and soft skills. I have deep knowledge of automated-testing and really understands how to assess and improve project quality. I like to solve difficult tasks, algorithms and take part in sport programming contests. I’m also interested in databases and unix based operating systems and has fallen in love with natural language processing and text mining.",
    "twitter": "a_soldatenko",
    "url": "https://asoldatenko.com/",
    "organization": "Toptal",
    "shirt_size": "Men's L",
    "title": "Crash test of Django ORM",
    "abstract": "This talk is dedicated to the proposition to crash test Django ORM 80% of functionalities in 20% of the time.",
    "description": "The world is swimming in articles and books about Django and Django ORM itself. All this sources cover only basic use cases of Django ORM comparing to real world examples.\r\nThis talk is dedicated to the proposition to crash test Django ORM 80% of functionalities in 20% of the time.  Also I’m going to show the important features and capabilities of Django ORM compare to most of SQL features. Traditionally, ORM is presented in a “bottom-up” fashion, but I would like to propose approach, on the other hand, is “top-down”. We begin by identifying a rather short list of standard questions, or precisely types of questions, that are often asked of relations databases. We then show how these standard questions are posted in Django ORM, introducing and motivating the use of its capabilities and features as they become relevant. ",
    "notes": "",
    "audience_level": "Intermediate",
    "tag_list": [],
    "rating": 0.0
  },
  {
    "name": "Chris Truncer",
    "email": "CTruncer@gmail.com",
    "avatar": "https://secure.gravatar.com/avatar/4f6063397641b8450dc2847bbb1409a1?s=500",
    "location": "Colorado",
    "bio": "Christopher Truncer (@ChrisTruncer) is a sys admin turned red teamer with Mandiant, and a previous Blackhat Instructor. He is a co-founder and current developer of the Veil-Framework, a project aimed to bridge the gap between advanced red team and penetration testing toolsets. Chris also works on a variety of other open-source projects such as EyeWitness, Just-Metadata, and more. Chris began developing toolsets that are not only designed for the offensive community, but can enhance the defensive community's ability to defend their network as well.",
    "twitter": "ChrisTruncer",
    "url": "https://www.christophertruncer.com/",
    "organization": "Mandiant",
    "shirt_size": "Men's XL",
    "title": "Bringing Down The House - How One Python Script Ruled Over Antivirus",
    "abstract": "This talk is about how a single python script has transformed into a framework for generating antivirus evading malware. This is the story all about how individuals have been playing the cat and mouse game with the multi-million dollar antivirus industry, but it hasn’t caught up with Python yet.",
    "description": "Development began in late 2012, but the problem really has been a thorn in our side for quite some time.  Penetration testers, red teamers, and offensive security professionals have been frustrated with antivirus for as long as we can remember.  Professional malware and exploit kit developers can bypass antivirus solutions with ease, so why can’t the white hat industry?  Well, it turns out we can, but there’s never been an open source option.  This is where Veil-Evasion steps in.\r\n\r\nI, along with others, began researching different methods to evade antivirus, and found a python solution!  One thing that we noticed, is that no matter how malicious we made our tool, antivirus continued to ensure us that we were safe :).  After nearly one year of having open sourced our solution Veil-Evasion, our python-based malware had its first signature.  Close to thirty minutes later, this “malware signature” was trivially bypassed by Veil-Evasion for the continued generation of “safe” executables.\r\n\r\nI plan on elaborating on how a single python script has transformed into a framework for generating antivirus evading executables. This is the story all about how individuals have been playing the cat and mouse game with the multi-million dollar antivirus industry, and haven’t been batted around yet.  One day the antivirus industry will utilize better detection methods for malware, but today is not that day.",
    "notes": "This is the outline of my entire talk.  I'd prefer for your CFP team to have all the details that I plan on talking about to best make a decision about this talk.  Thanks for your time and for reviewing this submission!\r\n\r\nIntro - This is a brief introduction about the talk, title, etc.\r\n\r\nWhat this talk is about  - This section of our talk will give an outline of everything I plan on discussing during the presentation.\r\n\r\nWhoami  - This is a brief overview of my background, project I’ve worked on, etc.\r\n\r\nOur Problem - This section will dive into problems offensive security professionals face.  This will primarily discuss the major issue which is when we need to compromise a machine and create malware, antivirus can at times prevent us from doing so.  In the end, we always defect antivirus, but the cost is time that could otherwise be spent testing a customer’s system.\r\n\r\nMalware Today - I’ll discuss how malware today commonly evades antivirus.  I’ll also talk about malware loaders and reflective dll injection, which is a common method for executing malware on a system.\r\n\r\nOur Solution - At this point I will introduce Veil-Evasion, which is our python-based solution to the problem we presented.  I’ll talk about the different project goals that we set out for ourselves when we started writing Veil-Evasion and how they help with AV evasion and/or usability.  I’ll showcare the python malware modules that have been developed and how they work.\r\n\r\nShellcode Injection - I’ll briefly discuss why we inject shellcode into memory when we run our AV Evading payloads, and how the technique works to receive a reflective dll.\r\n\r\nCompiling Windows Binaries on Linux - This section will highlight how we’ve managed to compile windows based payloads in multiple languages (C, C#, Python, Ruby, Go) on a Linux platform.\r\n\r\nOn-Disk Obfuscation - This section will document the different ways we’ve utilized python to obfuscate the source code to prevent on-disk detection by antivirus such as various encryption routines, letter substitution, encoding, and brute forcing of encryption keys.\r\n\r\nSignature Bypass - This section will be where I talk about how we encountered our first shot from the AV industry with their attempt to create a signature for Veil-Evasion python payloads.  I’ll also show the trivial bypass which was discovered after 30 minutes of testing.\r\n\r\nCurrent State - I’ll end the presentation of Veil-Evasion by showing where we started and where we’ve gone over 2+ years of development (various modules, how we update the modules over time, etc.).\r\n\r\nA Better Solution - This section will give a few hints how the AV industry could better detect malicious executables and avoid the pitfalls of signature based detection.\r\n\r\nCall to Action - I want to inspire the audience to be interested in learning more about testing the software that’s supposed to protect us, and to spark a fire by encouraging users to develop modules for Veil-Evasion!\r\n\r\nQuestions - At this point I will take question from the audience about the presentation\r\n",
    "audience_level": "All",
    "tag_list": [],
    "rating": 0.0
  },
  {
    "name": "Nick Doiron",
    "email": "ndoiron@mapmeld.com",
    "avatar": "https://secure.gravatar.com/avatar/93703e565323afcd226a76cf6baeb0f7?s=500",
    "location": "New York City, NY",
    "bio": "Nick is a traveling web developer and mapmaker. In the past he has worked with Code for America, One Laptop per Child, the City of Ulaanbaatar, and the Museum of Modern Art (NYC).  His next project is post-quantum encryption for your e-mail.",
    "twitter": "mapmeld",
    "url": "https://github.com/mapmeld",
    "organization": "ESRI R\u0026D Lab",
    "shirt_size": "Men's L",
    "title": "The Encrypted API: securing data with HTTPS and Paillier cryptosystem",
    "abstract": "This talk covers two tools for securing user data:\n- free HTTPS with LetsEncrypt's Python CLI\n- the Paillier cryptosystem - APIs can work on users' encrypted data without access to the unencrypted numbers",
    "description": "This talk covers two tools for securing your users' data while developing a public API.\r\n(1) getting a free HTTPS cert with LetsEncrypt's Python CLI\r\n(2) the Paillier cryptosystem - develop APIs which can work on users' encrypted data, without accessing the unencrypted numbers. As an example, you could develop an exchange-rate API without sharing transaction details.",
    "notes": "",
    "audience_level": "Beginner",
    "tag_list": [],
    "rating": 0.0
  },
  {
    "name": "PJ Hagerty",
    "email": "pjhagerty@gmail.com",
    "avatar": "https://secure.gravatar.com/avatar/632f4d3e6f9533628387e49bf3c282e9?s=500",
    "location": "Amherst, NY",
    "bio": "Developer, writer, speaker, musician, and Technical Advocate at IBM Bluemix, PJ is known to travel the world speaking about programming and the way people think and interact.  He is also known for wearing hats.",
    "twitter": "aspleenic",
    "url": "http://iampj.xyz",
    "organization": "IBM Bluemix",
    "shirt_size": "Men's S",
    "title": "Urban Legends: What You Code Makes You Who You Are",
    "abstract": "If you were a carpenter, would your skills at building be more important than the tools you use to build? Skills, right?  Tools are just a means to an end.  So why do developers think the language they use defines the problems they solve?",
    "description": "If you were a carpenter, would your skills at building be more important than the tools you use to build? Skills, right?  Tools are just a means to an end.  So why do developers think the language they use defines the problems they solve?\r\n\r\nThis talk will take a look at misconceptions across the board, some experiences, both positive and negative, people have had crossing barriers to new languages, and show some of the benefits thinking of one's self as a coder and not a \"Ruby coder\" or a \"PHP dev\" can have on being a better problem solver.",
    "notes": "The idea that we know everything there is to know about programming through one tool or language is a bit off.  This talk will focus on the stereotypes associated with certain languages, the biases between Open Source and Enterprise, and the importance of continuing to learn the craft of coding.",
    "audience_level": "All",
    "tag_list": [],
    "rating": 0.0
  },
  {
    "name": "Sarah Griffis",
    "email": "sgriff211@gmail.com",
    "avatar": "https://secure.gravatar.com/avatar/5b3c670cec487f87598b6e65465a6770?s=500",
    "location": "#\u003cOmniAuth::AuthHash country=#\u003cOmniAuth::AuthHash code=\"us\"\u003e name=\"Greater New York City Area\"\u003e",
    "bio": "Sarah Griffis is a Lead Engineer at Slice in NYC.  She's worked in data science, iOS, API engineering, and dabbled in devOps.  Outside of tech, Sarah loves coffee, Thai food, and running on the west side highway in NYC.  ",
    "twitter": "sgriff211",
    "url": "http://www.sarahgriffis.com/",
    "organization": "slicelife.com",
    "shirt_size": "Women's S",
    "title": "Xavier: Python and Ansible CI/CD Tooling",
    "abstract": "Who is Xavier?  Your Product Manager, Developer, and DevOps best friend!  Using a combination of Python and Ansible we created a tool to optimize our CI and CD pipeline nicknamed Xavier.  We utilize the Trello API, Slack integration, and hook a few Python arguments into an Ansible playbook.  ",
    "description": "As our small team grew into a medium sized engineering team, we found a number of challenges in our dev process.  In particular keeping track of what Trello tickets had been deployed (and when) became cumbersome for both developers and product managers.  Using Python scripts integrated with our Ansible integration, we were able to streamline our dev and product process through a few simple steps:\r\n1.  tag cards that had been deployed\r\n2.  create clearly labeled columns in Trello\r\n3. post deploy notes in Slack\r\n4. make a few other helpful improvements to our dev process. \r\n\r\nIn this talk, I will go through our Python scripts and various API resources needed to create tooling around dev process. I will walk through using Python in Jupyter notebooks, locally, and on production devOps boxes hosted on AWS.",
    "notes": "",
    "audience_level": "All",
    "tag_list": [],
    "rating": 0.0
  },
  {
    "name": "Sam Clarke",
    "email": "samclarke.g@gmail.com",
    "avatar": "https://secure.gravatar.com/avatar/66b20450242a77b01d4ec24925a18674?s=500",
    "location": "Unknown",
    "bio": "I'm a former Biologists (Degrees in Microbiology and Toxicology) who evolved into a programmer. An evolution which was cemented when I encountered Python.\r\n\r\nI spent several years working with the Charles Darwin Foundation in the Galapagos Islands, Ecuador where I built a number of apps showcasing data from Taxonomy to Meteorology. Some of these are even still online. I gave a lightning talk at Pycon US 2012 describing how we were using Python at the Foundation.\r\n\r\nFor the last 4 years I have worked with Rival Schools in Vancouver, helping transition the company from an agency model to developing their own applications  primarily for the entertainment industry. One of these applications is Script Speaker, which converts movie scripts to audio files with full part casting.\r\n\r\nI currently live on the Sunshine Coast of British Columbia, Canada, with my wife and our crazy sheep dog. \r\n\r\nMy full CV can be found here: https://github.com/samgclarke/curriculum-vitae/blob/master/curriculum-vitae.rst",
    "twitter": "samclarkeg",
    "url": "https://github.com/samgclarke",
    "organization": "Rival Schools, Script Speaker",
    "shirt_size": "Men's M",
    "title": "Using Celery in Production",
    "abstract": "Celery is a distributed asynchronous task queue written in python, which his recently matured to version 4.0. Setting up Celery correctly can be tricky and documentation is often dispersed or incomplete. This talk aims to cover the practical use of Celery in a production application.",
    "description": "Celery is an asynchronous task queue for Python. This talk will start with a brief introduction to Celery, how and when to use it in your project and a discussion of common scenarios and pitfalls of using celery in Production.\r\n\r\nWe will explore typical configurations of Celery in a production environment, how to keep Celery running happily and how to quickly diagnose failures.\r\n\r\nThe talk will consist of:\r\n* Quick introduction to distributed task queues\r\n* Configuring Celery for Production - general principals\r\n* Adding asynchronous tasks to your code\r\n* Storing and Retrieving Task results\r\n* Monitoring \u0026 Testing\r\n* Scaling Celery",
    "notes": "A version of this talk was prepared earlier in the year to be given at the Vancouver Python User group meeting, but was postponed due to scheduling. It is highly likely that I will have given the talk to this group before PyCaribbean starts.\r\n\r\nThe rational behind this talk is that I have spent a lot of time working with Celery on several projects over the last 12-18months and have encountered many of the issues which can prove frustrating when you meet them for the first time. While there is some excellent documentation out there (the official docs are much better than they were) they don't always reflect the notion of practical use in a production setting. \r\n\r\nThe pitch of this talk will be very much 'lessons learned from the trenches' rather than summarising the docs.\r\n\r\n*Please Note. There is obviously a lot of detail in this topic which cannot make it into a 45mins talk due to time constraints. Though I have a talk in mind, I could adapt this material to a workshop if the review panel thinks that would be a better medium.",
    "audience_level": "All",
    "tag_list": [],
    "rating": 0.0
  },
  {
    "name": "Gene Chorba",
    "email": "gchorba@gmail.com",
    "avatar": "https://secure.gravatar.com/avatar/d2200648743ea589b86d5f302639c584?s=500",
    "location": "Unknown",
    "bio": "While working as a Senior Developer Evangelist at Atlanta-based startup Ionic Security, Gene spends most weekends either speaking about security, or at a Hackathon. He has been written about in the NPR, AJC, NYT, Sports Illustrated, Huffington Post, Federal Times, and many other publications.",
    "twitter": "dualpandas",
    "url": "",
    "organization": "Ionic Security",
    "shirt_size": "Men's M",
    "title": "Implementing Encryption and Best Practices",
    "abstract": "Through this speech I will walk you through the various encryption libraries available, the direction that encryption is going, how to implement them and best practices when using them.",
    "description": "Python Development has featured commercial and government-grade encryption libraries from its earliest forms. Encryption libraries make it possible for organizations to protect data with the highest level of security.\r\nThese days encrypted applications should be the rule not the exception.\r\nThrough this speech I will walk you through the various encryption libraries available, the direction that encryption is going, how to implement them and best practices when using them.\r\nExample:\r\nHow to integrate PiCrypto into your project, it's strengths and it's weaknesses.",
    "notes": "Walk through of how the talk will be given:\r\nDescribe the importance of encryption. Why encrypted application should be the rule not the exception.\r\nSecurity breaches that could have been stopped with the use of encryption\r\nExplaining the different encryption libraries on the market, and how each one integrates differently.\r\nPain points and Best practices.\r\n\r\nI am the senior developer evangelist at Ionic Security, an Atlanta based security startup focused on encryption. When I am not speaking about security and encryption, you can find me at hackathons all over the United States. I have been written about in the NPR, AJC, NYT, Sports Illustrated, Huffington Post, Federal Times, and many other publications.",
    "audience_level": "All",
    "tag_list": [],
    "rating": 0.0
  },
  {
    "name": "Tracy Osborn",
    "email": "tracy@limedaring.com",
    "avatar": "https://secure.gravatar.com/avatar/55486de8dc13fc5996a34cd2d4cbfd85?s=500",
    "location": "Nomad",
    "bio": "Tracy Osborn is a designer, developer, and entreprenerd living in Toronto, Canada. She’s the author of Hello Web App and the upcoming Hello Web Design, as well as the creator of WeddingLovely. She's also an avid outdoorswoman and would love to go on a hike with you.",
    "twitter": "limedaring",
    "url": "http://limedaring.com",
    "organization": "Limedaring",
    "shirt_size": "Women's M",
    "title": "Writing Clear and Interesting Technical Content and Documentation",
    "abstract": "It’s hard to write documentation that anyone can get excited about. This is true for projects aimed at beginners, but it goes double for projects and writing aimed at intermediate/expert programmers. Find out how to write documentation that *everyone* would want to read and can understand. ",
    "description": "You’re smart, educated, and you’ve been working in this industry for years. You’ve created amazing open-source packages and great documentation. But all that flies out the window if what you write about your project isn’t being read.\r\n\r\n“But it’s comprehensive! It has all the info that I would need!” you may reply.\r\n\r\nThe problem is not writing for people like you; it’s writing and creating documentation that anyone can read, understand, and get excited about. This is true for projects aimed at beginners, but it goes double for projects and writing aimed at intermediate/expert programmers. Your projects will benefit when you write something that everyone can understand and would want to read. More readers = more users = perhaps more contributors!\r\n\r\nOutline:\r\n\r\n\r\n* Introduction\r\n\r\n   * About me and my experience.\r\n\r\n   * With Hello Web App, my book series.\r\n\r\n   * Running workshops and working with beginners.\r\n\r\n   * Being a relative newcomer myself.\r\n\r\n* The basics of friendly and welcoming writing\r\n\r\n   * Why make the effort to be friendly and welcoming?\r\n\r\n   * Better installation and usage instructions.\r\n\r\n   * “Dumbing things down” without making them dumb.\r\n\r\n   * Formality vs. informality.\r\n\r\n* The basics of writing clearly\r\n\r\n   * Cutting down your content.\r\n\r\n   * Better headlines.\r\n\r\n   * Making your content readable.\r\n\r\n* Conclusion\r\n\r\n* Questions\r\n\r\n",
    "notes": "I've written a few books aimed at learning how to code: http://hellowebapp.com\r\n\r\nI've spoken at quite a few other conferences: http://lanyrd.com/profile/limedaring/\r\n\r\nMy keynote at O'Reilly's Fluent: https://www.youtube.com/watch?v=IyHTYmSYJz8",
    "audience_level": "All",
    "tag_list": [
      "documentation"
    ],
    "rating": 0.0
  },
  {
    "name": "David Litvak Bruno",
    "email": "david.litvakb@gmail.com",
    "avatar": "https://secure.gravatar.com/avatar/58f5652bb5e072d755d62ae229965472?s=500",
    "location": "Buenos Aires, Argentina",
    "bio": "Ruby Evangelist, Agile devotee, frustrated sports legend and currently a developer evangelist at Contentful.\r\n\r\nDavid spends most of his days coding Ruby and slaying orcs and beasts in his favourite RPGs.",
    "twitter": "dlitvakb",
    "url": "https://dlitvakb.github.io",
    "organization": "Contentful GmbH",
    "shirt_size": "Men's M",
    "title": "Software Evangelism, wat?",
    "abstract": "What's our role in the company? Are we \"developers\"? Are we \"marketing people\"? \"Community Managers\"? Wat?\n\nWell, kinda all of that!",
    "description": "Let me explain to you the day-to-day of the often misunderstood Software Evangelist.\r\nWhat does our daily routine look like, what are our main tasks and roles within a company.\r\nHow we try to foster communities and make a sensible impact within our audiences and try to give them inspiration.",
    "notes": "I've been a Software Evangelist @ Contentful for the last year.\r\nI've been working very tightly in fostering the Ruby, Python and Javascript local communities in Argentina and Brasil.\r\nAs my \"developer\" role I provide developers with multiple tools and framework integrations to use Contentful with both Python and Ruby.",
    "audience_level": "All",
    "tag_list": [],
    "rating": 0.0
  },
  {
    "name": "Tom Gamble",
    "email": "thomasgamble2@gmail.com",
    "avatar": "https://secure.gravatar.com/avatar/2143a3a75b6c419249c0331ce5c2c551?s=500",
    "location": "Atlanta, GA",
    "bio": "Thomas Gamble is a technical principal at ThoughtWorks. Tom has worked in a variety of development and management roles. He’s currently enjoying contributing to open source and helping teams to deliver quality software more efficiently (while having fun).",
    "twitter": "gambtho",
    "url": "",
    "organization": "ThoughtWorks",
    "shirt_size": "Men's L",
    "title": "Step 1 - Python on PCF, Step 2 - ???, Step 3 - Profit!!!",
    "abstract": "Python can be a fantastic way to quickly develop powerful applications for a variety of use cases.   We'll show you how to make use of opinionated frameworks to get up an running quickly on one of the fastest growing cloud platforms.",
    "description": "### Take your python to the cloud!\r\n\r\nWondering how you can get started with the latest web frameworks and python?  Concerned about how to continuously integrate all the things, and have repeatable deployments?   All of these are solved problems, and can leverage tools and frameworks to allow you to focus on writing code you care about, not managing configuration details.",
    "notes": "Would like to co-present this with Jkruck@pivotal.io, is that possible?",
    "audience_level": "Beginner",
    "tag_list": [],
    "rating": 0.0
  },
  {
    "name": "Flavio Percoco",
    "email": "flaper87@gmail.com",
    "avatar": "https://secure.gravatar.com/avatar/3d4433e1428f01376f97cc6194e0f071?s=500",
    "location": "NomadList",
    "bio": "\r\n\r\nPrior to Red Hat, Flavio worked on Big Data oriented applications, search engines and message systems. He was also an active member of Gnome's a11y team where he contributed to Orca and created MouseTrap, a head-tracker application. Outside Red Hat Flavio likes to take run, travel, hang around with family and friends and whatever seems interesting.\r\n\r\nFlavio spends most of his time hacking on containers and messaging technologies in the OpenStack community where he's been part of several technical communities, served as a PTL and also as a Technical Committee member (where he still seats and contributes to).\r\n",
    "twitter": "flaper87",
    "url": "http://www.flaper87.com",
    "organization": "Red Hat, Inc.",
    "shirt_size": "Men's M",
    "title": "Keeping up with the pace of a fast growing community without dying",
    "abstract": "Once a community has gone beyond its limits, the community members, consumers and leaders will have to keep up with its pace. How do we keep our goals on track while allowing for further growth? How do we allow it to keep expanding without further damaging the community? Let's answer these questions",
    "description": "New open source communities are born everyday. Some of them are meant to last long and some others aren't. There's a moment in every community when it needs to outgrow itself, expand its limits and aim way higher than ever. This is no necessarily related to its goals but the ecosystem it needs to stay alive.\r\n\r\nOnce a community has gone beyond its limits, the community members, consumers and leaders will have to keep up with its pace. How do we help it to remain sane? How do we keep our goals on track while allowing for further growth? How do we allow it to keep expanding without further damaging the community?\r\n\r\nThese are all questions we ask ourselves everyday in the OpenStack community and that we've managed to work on without killing ourselves on the way.",
    "notes": "I'll present this talk as a keynote for Pycon South Africa! I'd be happy to do the same for PyCaribbean!",
    "audience_level": "All",
    "tag_list": [
      "community",
      "python",
      "openstack",
      "social"
    ],
    "rating": 0.0
  },
  {
    "name": "Jennifer Konikowski",
    "email": "jmkoni@icloud.com",
    "avatar": "https://secure.gravatar.com/avatar/2e94353b845f7f1b5248e936abaf8a3b?s=500",
    "location": "Somerville, MA",
    "bio": "I'm the founder and organizer of PyLadies Boston, an organization dedicated to bringing more women into the open-source community in Boston.  I currently work as a software developer at Akamai, but my passion is teaching women how to code.",
    "twitter": "jenkoni",
    "url": "http://www.jenniferkonikowski.com",
    "organization": "PyLadies Boston",
    "shirt_size": "Women's S",
    "title": "Building a Community For Beginners",
    "abstract": "How do you foster new developers within the community? I will tell you how I grew PyLadies Boston from zero to a thousand by focusing primarily on beginners.",
    "description": "Are you having trouble getting beginners to stick around in your user group? What's the best way to help people who are just getting started with Python? Since I started PyLadies Boston in 2013, I've learned a few lessons about the best way to help out beginners and cultivate a welcoming community. In this talk, I will cover:\r\n* Starting a group with the intention to be beginner-friendly\r\n* Creating a welcoming environment\r\n* Beginner friendly meeting topics\r\n* Running workshops and ensuring continued engagement\r\n* Finding the best way to teach people to code",
    "notes": "I have run PyLadies Boston from the beginning and we are now at almost 1000 members. I'm also a co-organizer of Boston Ruby Women. Both groups have helped increase the size (and amount of women participating) of their respective user groups.",
    "audience_level": "All",
    "tag_list": [],
    "rating": 0.0
  },
  {
    "name": "David Litvak Bruno",
    "email": "david.litvakb@gmail.com",
    "avatar": "https://secure.gravatar.com/avatar/58f5652bb5e072d755d62ae229965472?s=500",
    "location": "Buenos Aires, Argentina",
    "bio": "Ruby and Python Evangelist, Agile devotee, frustrated sports legend and currently a developer evangelist at Contentful.\r\n\r\nDavid spends most of his days coding Ruby and slaying orcs and beasts in his favourite RPGs.",
    "twitter": "dlitvakb",
    "url": "https://dlitvakb.github.io",
    "organization": "Contentful GmbH",
    "shirt_size": "Men's M",
    "title": "Fast Multi-Platform Prototyping: Quickly Create Apps and Content",
    "abstract": "Prototyping and testing application ideas is very useful nowadays.\nWe'll discover a few approaches to create apps across different platforms using the same content to test assumptions and deliver value to everyone.",
    "description": "Prototyping and testing application ideas is very useful nowadays.\r\nWe'll discover a few approaches to create apps across different platforms using the same content to test assumptions and deliver value to everyone.\r\n\r\nBy using a 'headless' API-First CMS to consume our structured data, we're able to deliver quality content throughout a myriad of devices.\r\n\r\nWe'll explore usage patterns that optimise our productivity and allow us to rapidly develop and test our ideas.",
    "notes": "I've been working for the last year in creating developer tools, tutorials and demos in Contentful. I enjoy helping developers be productive.\r\n\r\nThis talk is aimed to all developers regardless of their level, but intermediate to advanced will definitely get more value out of it. While beginners can learn a different and simpler approach to development.",
    "audience_level": "Intermediate",
    "tag_list": [
      "flask",
      "web",
      "mobile",
      "python",
      "agile"
    ],
    "rating": 0.0
  },
  {
    "name": "Miguel Palhas",
    "email": "miguel@subvisual.co",
    "avatar": "https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/145/14859599_1189040064509252_2017695031_o.jpg",
    "location": "Braga, Portugal",
    "bio": "I’ve made a jump from High-Performance Computing researcher to Web Developer, where I’ve been happily hacking for the past few years now, mostly writing Ruby and some awesome web animations.\r\n\r\nI have a passion for Open-source, and for giving back to the community. That’s why I’ve taught programming to hundreds of people (between meetups, university courses, 1-1 mentoring, and even our coding school), and have helped organize several local Meetups.\r\n\r\nMy company, Subvisual, is the sole organizer of RubyConf Portugal and MirrorConf.\r\n\r\nWhen I’m not busy building web products or bothering others with my teachings, I might be trying to become a real game developer. Being an astronaut is no longer an option, so that’s the one childhood dream I still have going on.",
    "twitter": "naps62",
    "url": "https://github.com/naps62",
    "organization": "Subvisual",
    "shirt_size": "Men's M",
    "title": "Mastering your Tools",
    "abstract": "This talk goes through some very practical advices about writing code efficiently: ranging from useful and perhaps-not-so-well-known tools, to some editor/terminal/OS configurations that I obsess over in order to tweak my environment to perfection.",
    "description": "I'm all about efficiency. Not just code execution efficiency, but also regarding my work tools, and my usage of them.\r\n\r\nHaving been an avid programmer and Linux user for several years now, and being obsessed with my workflow efficiency, I've amassed a pretty good understanding of how to improve productivity when it comes to writing code.\r\nFrom small but powerful configurations for my text editor that took me weeks to find to some not-so-well-known tools, I'm always thinking about how I can tweak my environment and workflow to perfection.\r\nHave you ever considered how many keys you hit during the day? And how can you go about minimizing that and train your muscle memory to make you more efficient?\r\nAnd what about that thing you're not even noticing you're spending so much time on, and that you could improve on?\r\n\r\nThis talk will feature some practical advice using my tools of choice (mostly Linux, tmux \u0026 Vim), and where applicable, all examples will be adapted to Python development.\r\nThe goal is not to try to tell you what to use, though. Instead, I want to show you a different perspective, and hopefully make you more aware of your efficiency, and of how you can improve it.",
    "notes": "I (jokingly) consider myself a professional over-engineer, because I can be pretty obsessive when it comes to finding the right way to do something. And, again, I apply this not just to the code I write, but to how I write it.\r\n\r\nI also love teaching, having given several talks \u0026 workshops and talks at local universities and meetups. This is where I started noticing that others (both novice and experienced developers) sometimes don't invest as much as they probably should into learning how to better take advantage of the tools they have at their disposal.\r\n\r\nThis talk might feature some live-coding (with the focus being on the tools used, not the actual code written). This might change, since I'll be heavily adapting the talk for the conference's audience. I can also adapt if the conference organizers prefer to stick to just slides.\r\n\r\nI have given a first version of this talk at a portuguese hackaton called [Pixels Camp](https://pixels.camp/). You can see the video on [YouTube](https://www.youtube.com/watch?v=jrBTpf7-yaw).\r\n\r\nThat said, the talk will be adapted given the different target audience, and the original feedback I got from it, so it will probably differ heavily from the video.",
    "audience_level": "All",
    "tag_list": [
      "workflow",
      "performance",
      "unix",
      "vim"
    ],
    "rating": 0.0
  },
  {
    "name": "Yamil Asusta",
    "email": "yamil.asusta@upr.edu",
    "avatar": "https://secure.gravatar.com/avatar/3f45152a4c7623d5c23cad3bc528d6ea?s=500",
    "location": "Unknown",
    "bio": "Sometimes in engineering, sometimes in marketing (yes, really!) sometimes in devops. Always with a beer at hand. ",
    "twitter": "elbuo8",
    "url": "http://yamilasusta.com/",
    "organization": "Auth0",
    "shirt_size": "Men's XL",
    "title": "Do I need a DevOps?",
    "abstract": "Recently DevOps, SREs and Production Engineers are all the buzz. Do we need all of these? This talk will try to cover scenarios in which hiring a dedicated DevOps is overkill and when it's absolutely necessary taking into account costs, responsibilities and SLAs.",
    "description": "Companies often spend many engineering cycles trying to get their operations (CI, deployments, infrastructure, etc) right from the first time. On the other hand, there are those who acquire this technical debt since day one. There are those who get a dedicated DevOps individual to tackle this. Via this talk I'll cover the different trade offs and compromises an organization should take into account before investing (or not) into these aspects of their organization. ",
    "notes": "",
    "audience_level": "Advanced",
    "tag_list": [],
    "rating": 0.0
  },
  {
    "name": "John Gill",
    "email": "swfiua@gmail.com",
    "avatar": "https://secure.gravatar.com/avatar/57e508584091ccc68f6be42d37e995e4?s=500",
    "location": "Unknown",
    "bio": "I am living in Bermuda and have been working on catastrophe modelling for 20 years. using free software throughout this time.\r\n\r\nI attended PyCaribbean in Santo Domningo last year and spoke about climate.\r\n\r\nI am also involved in raising awareness of free software, open data and the power of collaborative research here in Bermuda.",
    "twitter": "swfiua",
    "url": "http://openbermuda.org/80days/",
    "organization": "",
    "shirt_size": "Men's L",
    "title": "Climate, karma, pi and jupyter",
    "abstract": "Using jupyter, matplotlib, pandas, numpy and scipy to explore climate data.\n\nSunspots, earthquakes, oceans, planets and storms.\n\n",
    "description": "This talk will describe how the python community is supporting research everywhere that is helping our understanding of our world.\r\n\r\nOpen sharing of knowledge, making research papers freely available, along with the data described in the papers.\r\n\r\nExtracting the signal from the noise.",
    "notes": "*Update Dec 2016*\r\n\r\nThe karma pi project has progressed a bit to the point where I will be able to use it and git to give the talk.\r\n\r\nI've also submitted a talk proposal to PyCon on \"Removing the GILly one, one letter at a time\".  \r\n\r\nThere is stuff about async and await, and other mysteries.\r\n\r\nI am hoping that others from Bermuda that have been working on the projects will be able to get to the conference too.\r\n\r\nIf so, then I should have a helper for the talk.  Better still two.\r\n\r\n** David Beazley's curio has passed maximum stinging bat density and pig says hello **\r\n\r\n*end update*\r\n\r\nThis talk is aimed at a wide audience and aim to be accessible to any attendee.\r\n\r\nI am hoping to meet others with similar interests or who can help provide insights in the ideas  I am exploring.\r\n\r\nA range of subjects will be discussed.   With particular reference to the Caribbean and small islands globally.\r\n\r\nSee the Karma Pi project for the work in progress:\r\n\r\nhttps://github.com/openbermuda/karmapi",
    "audience_level": "All",
    "tag_list": [
      "python",
      "jupyter",
      "pandas",
      "matplotlib",
      "climate",
      "community",
      "experimental"
    ],
    "rating": 0.0
  },
  {
    "name": "Cristian Medina",
    "email": "cabkarian@gmail.com",
    "avatar": "https://secure.gravatar.com/avatar/24b5c0376a8cd683a4c47b98be5fb343?s=500",
    "location": "Unknown",
    "bio": "Born in the Dominican Republic, I went to college at UPR Mayagüez for Computer Engineering and spent the next 14 years in some sort of test engineering role, where I've developed hardware and software tooling to help enable cross-geographical organizations to plan, execute, manage and monitor their operations as needed. I've worked with many programming languages developing all sorts of applications from low-level software that interacts directly with firmware, to infrastructure services applications, all the way up to higher level business apps. Throughout my journeys, Python has been - and continues to be - my language of choice. ",
    "twitter": "tryexceptpass",
    "url": "https://medium.com/@tryexceptpass",
    "organization": "",
    "shirt_size": "Men's M",
    "title": "A Python Ate My GUI",
    "abstract": "Short overview on GUI development options for Python, with some thoughts on future possibilities and lessons learned from my own experiences while writing the sofi module (github.com/tryexceptpass/sofi) and the discussions that came after posting about it on medium.",
    "description": "Staring at my coworkers, already knowing the inevitability of the situation, my eyes roll as the argument ensues yet again: “I told you I can write that code twice as fast, in half as many lines and they’ll be cleaner and more readable than yours will ever be! Python is awesome!” — said the one guy.\r\n“Whatever you say, you’ll never be able to make a UI that’s half as good as this. It won’t look pretty and no one will want to use it!” — replied the other — “Probably can’t even make it run on Windows” — he mumbled to himself while walking away.\r\n\r\nSome years ago this was a regular exchange between coworkers, and while they were mostly messing around, there was still an element of truth to it. Regardless of its capabilities, Python was mostly known as a “scripting” language — not really for graphical interfaces — and the world was still looking for a native OS feel in their GUI applications, which was not really accessible from Python without a lot of work.\r\n\r\nWhere are we now with user interfaces? How does this picture look like for Python? Where do we want to be? How can we best leverage the technologies of today? Where should we improve? What can we do so that Python is ready for the future of user interfaces? These are some of the questions that I'd like to start answering.\r\n",
    "notes": "",
    "audience_level": "All",
    "tag_list": [],
    "rating": 0.0
  },
  {
    "name": "Kevin Najimi",
    "email": "knajimi@movidian.com",
    "avatar": "https://secure.gravatar.com/avatar/a08fa57c4233407cf9cbc81d14250e5c?s=500",
    "location": "Unknown",
    "bio": "Kevin Najimi is a Solution Architect in the investment management space.  He has 15 years of experience building quant research and algorithmic trading systems.  He is an active member of the Chicago and New York algorithmic trading community.  He studied at the University of Wisconsin-Milwaukee and the University of Chicago.  He is also a CFA candidate.\r\n",
    "twitter": "Kevin_Najimi",
    "url": "",
    "organization": "",
    "shirt_size": "Men's M",
    "title": "Algorithmic Trading with Python",
    "abstract": "Ever wonder what it takes to get started using Python to manage your investments and automate your trading? This demo-rich talk will walk through how to get started the right way and avoid some of the dangerous pitfalls. ",
    "description": "It’s never been easier or more exciting to get started writing Python to manage investments and automate trading. This talk will walk through how to get started the right way and avoid some of the dangerous pitfalls.\r\n\r\nThe talk consists of background for us to understand what we need to build, a number of demos using Quantopian, and a tour of alternative Pythonic approaches.\r\n\r\nThe goal of the talk is to get you up-and-running exploring your own investment ideas with Python by the end of the hour.",
    "notes": "I'm a Solution Architect in the investment management space.  Have been building quant research and algorithmic trading systems for many years.  Have over 15 years of experience.  Member of the Chicago and New York algorithmic trading community.  Also have educational background in this space.  \r\n\r\nHave spoken on this topic in the past. Has gotten a good turnout in the past. Not vendor or project specific...just use Quantopian for demos because its the easiest option for audience members to follow along and get started on their own. Code samples available prior to talk. Slides available after the talk. Open to suggestions the bio and abstract. Thanks for your consideration.",
    "audience_level": "Beginner",
    "tag_list": [
      "python",
      "investements",
      "trading",
      "finance",
      "data"
    ],
    "rating": 0.0
  }
]