[
  {
        "name": "Alvaro Leiva Geisse",
        "email": "aleivag@gmail.com",
        "avatar": "https://secure.gravatar.com/avatar/e84bcf837bc03baed9f7e8c3ecd8a368?s=500",
        "bio": "I love Python, I grew up in a small town in Chile and one weekend, 16 years ago, I had the flu and could not go out. I decided to learn how to code in Python and that was the beginning of the road that would moved us all to the Northern California so that I could join the Production Engineering team at Instagram. Also like eating and cooking (in that order).",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "systemd and why should you care as a python developer",
        "Schedule": "",
        "Category": "Tooling",
        "Language": "English",
        "abstract": "Your shiny new application is done and ready to be deployed! But how exactly do you deploy properly on Linux? Wonder no more! In 40 minutes, this talk explains how you can harness the power of systemd to solve common deployment problems, including some that you didn't even know you had.",
        "description": "Done! Your shiny new application is functionally complete and ready to be deployed to production! But how exactly do you deploy properly on Linux? Wonder no more! In 30 minutes, this talk explains how you can harness the power of the init system and systemd to solve common deployment problems, including some that you didn't even know you had:\n\n# How to secure your system by having: private /tmp for your process, read-only paths so that your process can not write to them, inaccessible paths, protect users home, network access, bin directories, etc.\n# How to limit the resources you app can consume.\n# How to interact directly with systemd, so it can start transient units, start/stop services, mount disks, resolve addresses.\n# How to isolate your service without containers.\n# How to isolate your service using containers (using systemd to spawn a namespace).\n\nAll this will be covered from a Python developer's perspective.",
        "audience_level": "Intermediate",
        "tags": "[\"systemd\", \"devops\", \"systems\", \"deploy\"]",
        "rating": 20.0
    },
    {
        "name": "Andrew Knight",
        "email": "andylpk247@gmail.com",
        "avatar": "https://secure.gravatar.com/avatar/122c151438d371097daee11f072951f3?s=500",
        "bio": "Andy Knight is the \"Automation Panda\". He is a software engineer whose specialty is building test automation systems from the ground up, which involves both software development for test code as well as the infrastructure to run it in continuous integration. Currently, he is a Software Engineer in Test at PrecisionLender in Cary, NC. He also does independent consulting and training, and he is an avid Pythoneer. Check out his software blog at www.automationpanda.com.",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "Behavior-Driven Python with pytest-bdd",
        "Schedule": "",
        "Category": "Test",
        "Language": "English",
        "abstract": "Given I need to automate tests, When I use pytest-bdd, Then my tests are readable, reusable, and Pythonic. AWESOME! Attend this talk to learn how to use pytest with pytest-bdd to improve the quality of your tests and your code!",
        "description": "Test automation is treated like a necessary evil. We know we should automate our tests, but it takes time and effort. **pytest-bdd**, a plugin for the awesome **pytest** framework, makes it *much* easier to write tests by enabling Behavior-Driven Development (BDD) features. Using **pytest-bdd**, teams write tests in plain language using Gherkin (e.g., Given-When-Then steps), and then programmers write Python code to automate the steps. BDD testing is great because tests are self-documenting and steps abide by the DRY principle. And all the goodness of **pytest** is available. An example test could be:\n\n*Given* the DuckDuckGo home page is displayed\n*When* the user searches the phrase \"Python\"\n*Then* search results for \"Python\" are shown\n\nThis talk will teach how to use **pytest-bdd** to develop well-designed test scenarios and a robust automation framework. It will focus on the layers of the **pytest-bdd** framework: feature files, step definitions, and support classes. A full example project will be hosted on GitHub for audience members to reference after the talk.",
        "audience_level": "All",
        "tags": "[\"Python\", \"Testing\", \"Automation\", \"pytest\", \"best practices\", \"open source\", \"documentation\"]",
        "rating": 0.0
    },
    {
        "name": "Andrew Knight",
        "email": "andylpk247@gmail.com",
        "avatar": "https://secure.gravatar.com/avatar/122c151438d371097daee11f072951f3?s=500",
        "bio": "Andy Knight is the \"Automation Panda\". He is a software engineer whose specialty is building test automation systems from the ground up, which involves both software development for test code as well as the infrastructure to run it in continuous integration. Currently, he is a Software Engineer in Test at PrecisionLender in Cary, NC. He also does independent consulting and training, and he is an avid Pythoneer. Check out his software blog at www.automationpanda.com.",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "Egad! How Do We Start Writing (Better) Tests?",
        "Schedule": "",
        "Category": "Testing",
        "Language": "English",
        "abstract": "Some have never automated tests and can't check themselves before they wreck themselves. Others have 1000s of tests that are flaky, duplicative, and slow. Wa-do-we-do? GOOD testing is hard but not impossible. Start with proven advice from this talk!",
        "description": "Some have never automated tests and can't check themselves before they wreck themselves. Others have 1000s of tests that are flaky, duplicative, and slow. Wa-do-we-do? GOOD testing is hard but not impossible. To show how to get it done, we will follow the story of Amanda the Panda (representing the everyday Pythoneer) as she jumps into testing and automation with Python.\n\nHer journey includes:\n\n1. How do I play buzzword bingo for testing?\n2. Why do I need feature tests and not just unit tests?\n3. What skills do I need?\n4. What framework should I use?\n5. How do I avoid duplicating test code?\n6. How do I handle test data?\n7. There are too many tests! Which ones should I automate?\n8. How do I run tests in continuous integration?\n9. How do I make tests reliable so they stop failing again and again?\n10. How do I hire Software Engineers in Test?\n\nAll examples will be given in Python (of course).",
        "audience_level": "All",
        "tags": "[\"Python\", \"Testing\", \"Automation\", \"Selenium WebDriver\", \"REST\"]",
        "rating": 0.0
    },
    {
        "name": "Christian Weber",
        "email": "webdog@github.com",
        "avatar": "/img/speakers/christian-weber.jpg",
        "bio": "Christian Weber is a Remote-First, Solutions Engineer at GitHub. After spending the first chapters of his career in Financial Technology, Christian now focuses on assisting both cultural and digital transformation in large and small software organizations. In his spare time, Christian enjoys playing guitar, listening to loud music, and zoom-zooming in his Miata!",
        "talk_format": "Workshop (> 60 minutes)",
        "title": "Engineering Pop Songs with Python",
        "Schedule": "",
        "Category": "Misc",
        "Language": "English",
        "abstract": "Have you ever wanted to create music, but were intimidated by learning an instrument? Have you wanted to learn how to program, but we're afraid of learning cryptic commands? If so, this talk is for you! Let's learn the fundamentals of programming to re-create a well known pop song!",
        "description": "In this workshop, we'll discuss the fundamental structure of programming and music with the use of Python. Python is a widely-used, and human readable programming language that allows users to quickly write code and solve problems. We'll discuss the structure and rules of music:\n\n* Basic Music Theory and Notes\n* The Major Scale\n* The Minor Scale\n* Chords\n\nWe'll take all of these concepts, and using the power of Python, re-create a famous pop song using only our computer! This talk is great for understanding the following concepts in Python:\n\n* Basic types\n* Classes with an OOP paradigm\n* Data Structures\n* Control Flow",
        "audience_level": "Beginner",
        "tags": "[\"python\", \"music\", \"learning\", \"beginner\", \"intermediate\", \"open source\"]",
        "rating": 21.0
    },
    {
        "name": "Dane Hillard",
        "email": "github@danehillard.com",
        "avatar": "https://secure.gravatar.com/avatar/9da94e6b6107563a68d185a02137a32e?s=500",
        "bio": "I like leveraging software development skills for good. During my short career I've had a chance to work in the fields of counterterrorism, cancer research, and education. I'm an    read more about the upcoming [Piquant](https://piquantmag.com/about) if you like. [I made a music album](https://www.littleleviathan.com) once and [I make fashion and portraiture photography](https://www.danehillard.com) here and there.",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "Multiple Inheritance and Mixins",
        "Schedule": "",
        "Category": "Python",
        "Language": "English",
        "abstract": "If you're like me, your class hierarchies may be getting out of hand. Inheritance has proven hairy and now your code is giving you headaches. Composition may be good for what ails you! Come see how this works in Python and add another tool to your belt for cleaning up your code.",
        "description": "At the advent of object-oriented programming, inheritance and the class hierarchy reigned supreme. You could model _anything_, from `Animal` all the way down to `Animal` -> `Mammal` -> `Dog` -> `UtilityDog` -> `FrenchBulldog`. Eventually this got out of hand.\n\nToday, composition brings many of the benefits of complex inheritance while keeping functionality focused and isolated. In many languages, composition is achieved via the interface pattern; an object can declare its intent to _implement_ a particular interface and as a result is beholden to support the behaviors that interface outlines. In Python, there is no such thing as an interface! What do we do about that?\n\nFortunately, Python provides the ability to support something interface-like (and more) via _multiple inheritance_. In multiple inheritance, an object may inherit from multiple other objects. Let's explore how this works, what pitfalls to look out for, and how not to repeat the past when dealing with class hierarchies.",
        "audience_level": "Intermediate",
        "tags": "[\"python\", \"software development\", \"classes\"]",
        "rating": 20.0
    },
    {
        "name": "Dave Poortvliet",
        "email": "poortvld@gvsu.edu",
        "avatar": "https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/23254/Dave.jpg",
        "bio": "Dave has been providing technical direction and oversight of university web operations at Grand Valley State University for over 15 years. He ensures design and development of custom web applications align with the strategic goals of the organization. Dave leads, manages, and mentors a talented team of web developers, designers, and student workers to deliver custom web applications that provide value to the faculty, staff, and students of the university.",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "Twitter Data Mining for Political Sentiment",
        "Schedule": "",
        "Category": "AI",
        "Language": "English",
        "abstract": "In this talk, I'll show you how to quickly set up packages and API's in R so you can start exploring large data sets from Twitter. I'll walk through how to interpret data to better understand sentiment around a specific topic and how geographic location can impact sentiment.",
        "description": "In this talk, I'll show you how to quickly set up packages and API's in R so you can start exploring large data sets from Twitter. I'll walk through how to interpret data to better understand sentiment around a specific topic and how geographic location can impact sentiment. Here's what I will cover:\n\n* Basic data search\n* Extracting data for a file\n* Investigating a specific Twitter user\n* Group sentiment analysis\n* Geolocation trend analysis\n",
        "audience_level": "All",
        "tags": "[\"R\", \"big data\", \"data science\", \"social media\", \"data analysis\", \"twitter\", \"sentiment analysis\", \"politics\", \"political\", \"data mining\"]",
        "rating": 21.0
    },
    {
        "name": "David Hemmat",
        "email": "dhemmat@bluecoding.com",
        "avatar": "/img/speakers/david-hemmat.jpg",
        "bio": "",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "Hiring top talent for your team",
        "Schedule": "",
        "Category": "Business",
        "Language": "Spanish",
        "abstract": "At Blue Coding we hire dozens of developers a year for both internal and client projects. We will be discussing what things we have found are important for developers that are looking to join a new team and how you can hire and retain the best of the best.",
        "description": "In this talk we will explore what things developers are looking for, and how to hire them and keep them on your team. \n\nWe will be discussing the following topics: \n\n- Why developers look to change jobs\n- What they are looking for in a new job or project\n- How to interview well without getting false negatives\n- How to keep your dev team happy\n\n",
        "audience_level": "All",
        "tags": "[\"hiring\", \"management\", \"developers\"]",
        "rating": 0.0
    },
    {
        "name": "David Tavarez",
        "email": "davidftavarez@gmail.com",
        "avatar": "https://secure.gravatar.com/avatar/aa1c0068b4e6289adee5fd3fdf1f9cc9?s=500",
        "bio": "I'm David Tavarez, an Open Source advocate, Software engineer, Security and privacy freak and Pentester enthusiast. I've been coding since I was 12 years old, I like to learn (as much as I can) how things are done and how much I can improve them. I help business to achieve their goals through Software. I'm really passionate about Community and Technology. I'm not really tight to a programming language, since I can code in Python, C#, PHP, Java, Javascript and C, and mre. When I'm not writing code, you can find me playing basketball, traveling with friends and family or doing political activism.",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "How to scan a whole country for fun and... yes, just for fun!",
        "Schedule": "",
        "Category": "Security",
        "Language": "English",
        "abstract": "What could we find if we're able to mass scan a whole country? According to recent data, the average cost of a data breach will exceed $150 million by 2020 and by 2019, cyber-crime will cost businesses over $2 trillion. Let's try not to be a part of those statistics.",
        "description": "Python is one of the favorite programming languages used by Security Experts to develop the most advanced pentesting tools. In this talk we're going to audit most of the public IP blocks of the Dominican Republic to find popular remote vulnerabilities used by cyber criminals worldwide to gain unauthorized access. The main goal is to make ourselves aware of the danger of underestimating efforts in securing ours companies and clients.",
        "audience_level": "Intermediate",
        "tags": "[\"python\", \"security\", \"devops\", \"masscan\", \"nmap\"]",
        "rating": 0.0
    },
    {
        "name": "Dustin Ingram",
        "email": "di@python.org",
        "avatar": "https://secure.gravatar.com/avatar/e5cc71215389f7c74b1f459e1ee52c42?s=500",
        "bio": "I'm Dustin (aka [@di](<https://github.com/di>)), a Developer Advocate at Google, focused on supporting the Python community on the Google Cloud Platform. I'm also a member of the [Python Packaging Authority](https://github.com/orgs/pypa/people), maintainer of the [Python Package Index](https://pypi.org/), and organizer for the [PyTexas](https://www.pytexas.org) conference.",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "What's new in Python 3.7",
        "Schedule": "",
        "Category": "Python",
        "Language": "English",
        "abstract": "Python 3.7 is here! In this talk, we'll explore several new standard library modules, new syntax features and changes, and other performance improvements and implementation changes and what it means for us as Python developers.",
        "description": "# Description\n\nPython 3.7 is here! In this talk, we'll explore several new standard library modules, new syntax features and changes, and other performance improvements and implementation changes and what it means for us as Python developers.\n\nWe'll also briefly chat about what exciting things didn't quite make it into 3.7, but we should expect to see in 3.8.\n\n# Outline\n\n* New things in Python 3.7\n* New standard library modules\n* Dataclasses\n* History of dataclasses\n* The attrs project\n* Usefulness\n* Contextvars\n* Usefulness\n* Order-Preserving Dictonaries\n* History of Python Dictionary implementation\n* Recent changes\n* Usefulness\n* Modules supportings `__getattr__` and `__dir__` (PEP 562)\n* Usefulness (lazy-loading, deprecation)\n* The async and await keywords\n* PEP 563: postponed evaluation of type annotations\n* Upcoming in Python 3.8\n",
        "audience_level": "All",
        "tags": "[]",
        "rating": 20.0
    },
    {
        "name": "Elise Micheals",
        "email": "365dayloveproject@gmail.com",
        "avatar": "https://secure.gravatar.com/avatar/95d227e40f043a240e6a30eed251337a?s=500",
        "bio": "Elise Micheals is a Sales Engineer for a tech company, working entirely remote and living her life as a digital nomad. Through her travels, she's been able to speak with teams from all walks of life, become the first Global leader for her company, volunteer her skills to help others obtain jobs and still be able to build her own business on the side. \n\nA former actress with a passion for learning, I strive to empower myself and others each and every day. I truly believe anything is possible and will continue to play my part in helping people achieve their dreams.",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "Essential Communication Skills for Business",
        "Schedule": "",
        "Category": "Business",
        "Language": "English",
        "abstract": "Get hired for more jobs. \n\nBeing a coder, many times we're pegged for being anti-social and in the dark. With knowledge far above peoples heads, I teach developers essential skills not only for communicating better, but for negotiating pay raises, and standing out amongst a competitive market.",
        "description": "How many times have you explained something to someone and felt confused? Or left an interview feeling like it could have gone a lot better? OR, maybe you felt it went well, and STILL didn't get hired? \nThis talk breaks down the main communication skills necessary to become hired for more jobs, make your project more easily digestible to the untrained eye, and encourage social skills that set you above the rest. \n\nI work in tech, and this is something I've so desperately seen that's needed in the community. Having a lot of intellect can sometimes be more hurtful than helpful - My goal is to help the intellectual being able to have a personality to match the skills they've worked so hard to obtain.",
        "audience_level": "All",
        "tags": "[\"soft skills\", \"Business\", \"entrepreneurship\"]",
        "rating": 21.0
    },
    {
        "name": "Eneldo Serrata",
        "email": "eneldoserrata@gmail.com",
        "avatar": "https://secure.gravatar.com/avatar/c2815c53f0c79f572d7d44042481b865?s=500",
        "bio": "",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "Odoo IoT",
        "Schedule": "",
        "Category": "IOT",
        "Language": "English",
        "abstract": "IoT o Internet of Things se refiere a la creciente red de objetos físicos que cuentan con una dirección IP para la conectividad a Internet. compartiremos como connectar sensores a con Odoo.",
        "description": "",
        "audience_level": "All",
        "tags": "[\"python\", \"Odoo\", \"IoT\"]",
        "rating": 0.0
    },
    {
        "name": "Grishma Jena",
        "email": "grishma.jena@gmail.com",
        "avatar": "https://secure.gravatar.com/avatar/4f25eff0c4817bd23f912356192509af?s=500",
        "bio": "Grishma is a Cognitive Software Engineer with the Data Science for Marketing team at IBM Watson in San Francisco. She earned her Masters in Computer Science at University of Pennsylvania. Her research interests are in Machine Learning and Natural Language Processing. She was recently a mentor for AI4ALL's AI Project Fellowship Spring 2018 where she guided a group of high school students to use AI for prioritizing 911 EMS calls. In her free time, she writes, cooks and likes conducting workshops and delivering talks. She likes explaining things in an easy-to-understand format, drawing analogies from real-life (eg. using Uncle Scrooge to explain Greedy Algorithms https://medium.com/the-graph/uncle-scrooge-meets-greedy-algorithms-dfc80c33d7ac). https://www.linkedin.com/in/grishmajena/",
        "talk_format": "Workshop (> 60 minutes)",
        "title": "A hands-on introduction to Natural Language Processing in Python",
        "Schedule": "",
        "Category": "AI",
        "Language": "English",
        "abstract": "This workshop introduces Natural Language Processing using Python. Attendees start off with textual data and learn how to process it to derive useful insights that can be used in real-world applications. Sample applications include sentiment analysis, topic modeling, similarity detection.",
        "description": "With the advent of voice-based assistants and chatbots in our homes, our phones and our computers, businesses, stakeholders and developers want to learn about language processing. But how exactly do these devices understand human language? How can they interpret similar intents even when different words are used? What does Natural Language Processing mean and what are the steps involved?\n\nThis workshop introduces Natural Language Processing to those with previous programming experience, though not necessarily in Python. Attendees start off with textual data and learn how to process it to derive useful insights that can be used in real-world applications. Tools introduced and explored include Jupyter, NLTK, pandas, sklearn and numpy. \n\n* Overview of natural language processing\n* Word and sentence tokenization\n* Part of speech tagging\n* Distance metrics\n* Stemming, lemmatization and word senses\n* Bag of words\n* N-grams\n* Word2Vec and topic modeling\n* Sentiment analysis\n* Brief module on neural nets and chatbots\n* Additional resources\n\nBy the end of this tutorial, participants will be able to apply techniques of Natural language processing to textual datasets and create predictive models along with having sample projects to show in their portfolio. The vision is that participants feel motivated to create NLP-based applications and apply it to real-life examples like chatbots, analyze news sentiments, predicting gender from tweets.",
        "audience_level": "Beginner",
        "tags": "[\"Python\", \"Workshop\"]",
        "rating": 0.0
    },
    {
        "name": "Heidi Waterhouse",
        "email": "h.waterhouse@gmail.com",
        "avatar": "https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/1497/KCDCportrait0279.JPG",
        "bio": "Heidi is a developer advocate with LaunchDarkly. She delights in working at the intersection of usability, risk reduction, and cutting-edge technology. One of her favorite hobbies is talking to developers about things they already knew but had never thought of that way before. She sews all her conference dresses so that she's sure there is a pocket for the mic.\n",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "Tinkertoys, microservices, and feature management: How to build for the future",
        "Schedule": "",
        "Category": "Testing",
        "Language": "English",
        "abstract": "Lots of us aren't developing tidy, discrete features that are easy to manage. How do you plan to move from a tangle of interconnected features to something that you can test and deploy each part of? Join us for an overview on the conceptual basis of designing for feature management.",
        "description": "It sounds simple to say that we will build one feature at a time, give it an API interface and allow it to connect with other features and microservices. The implementation is anything but simple. This talk explores how you can start migrating your existing features and services to a more modular, testable, and resilient system.\n\nSince containers are not state-aware, how do you make changes to their presentation without needing to rebuild them entirely? With feature flags, your container can be stable and your presentation dynamic. How can you test a distributed architecture on your laptop? How can you simulate partial outages? This talk is going to touch on some of the best practices that you can use to bring new life to your brown fields.\n",
        "audience_level": "All",
        "tags": "[\"testing\", \"backend\", \"microservices\", \"feature management\", \"feature flags\", \"best practices\"]",
        "rating": 19.0
    },
    {
        "name": "Heidi Waterhouse",
        "email": "h.waterhouse@gmail.com",
        "avatar": "https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/1497/KCDCportrait0279.JPG",
        "bio": "Heidi is a developer advocate with LaunchDarkly. She delights in working at the intersection of usability, risk reduction, and cutting-edge technology. One of her favorite hobbies is talking to developers about things they already knew but had never thought of that way before. She sews all her conference dresses so that she's sure there is a pocket for the mic.\n",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "Every Scar A Story: The links between development practice, source control, testing, and deployment",
        "Schedule": "",
        "Category": "Testing",
        "Language": "English",
        "abstract": "This talk explores some industry-standard practices around code repositories, branching, and why we handle code the way we do and what it says about the past traumas of our organization and how much \"best practice\" and tools affect each other.",
        "description": "Scars result from trauma to our bodies.\n\nOrganizational scars are the same. The way we structure our organizations and systems is a reaction to things that went wrong before. We hope to avoid the same mistakes, so we put in a bunch of process and checks around the known problem. Eventually, the organization changes enough that we don't remember why that process exists, but we still keep it.\n\nThis talk explores some industry-standard practices around code repositories, branching, and why we handle code the way we do and what it says about the past traumas of our organization and how much \"best practice\" and tools affect each other.\n\nCome listen if you're interested in examining something you take for granted, and thinking about how you can ask questions about your process.\n",
        "audience_level": "All",
        "tags": "[\"deployment\", \"feature flags\", \"development style\", \"history\", \"source control\"]",
        "rating": 21.0
    },
    {
        "name": "Ivan Torroledo",
        "email": "ivan.torroledo@gmail.com",
        "avatar": "/img/speakers/ivan-torroledo.jpg",
        "bio": "Ivan Torroledo is a data scientist in the Cyxtera Research organization. In this role, he develops and implements machine and deep learning algorithms to enhance phishing detection, network security, fraud detection, and malware mitigation. Ivan is also highly interested in research on the application of machine and deep learning in high energy physics and astrophysics. Before joining Cyxtera, he worked at the Central Bank of Colombia, applying high performance computing tools to monetary policy analysis. He is passionate about applying the most advanced scientific knowledge to cyber security industry. Ivan holds degrees in Economics and Physics.",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "Building next generation writers using AI",
        "Schedule": "",
        "Category": "AI",
        "Language": "Spanish",
        "abstract": "Could a machine write an original book? it's known among AI community that ML algorithms helps to automate many tasks, nevertheless, machines will never match human creativity. In this talk we'll discuss how to create a text generator algorithm capable to replicate the creative writing process",
        "description": "This talk is based on the research paper DeepPhish: Simulating AI (https://bit.ly/2LH3jYQ), where it was designed an AI text generator capable to create URLs to bypass an AI phishing detection system. Using this theory, we are going to present an alternative application of natural language processing. Specifically, we will show how to build an AI text generator capable to learn the writing style of most famous writers and even capable to create its own style. The talk is design to cover from most basic natural language processing concepts, main techniques for text preprocessing to finally apply the these concepts to design our first AI powered writer.\n\n\nOutline\n\nIntroduction: 3 min\nNLP fundamentals: 7 min \nData preprocessing: 6 min\nBuilding an AI text generator: 10 min\nExamples: 6 min\n\nTotal time: 32 min",
        "audience_level": "Intermediate",
        "tags": "[\"Artificial Intelligence\", \"Machine Learning\", \"Natural Language Processing\", \"Human Automation\", \"Creative AI\", \"Data Science\", \" Deep Learning\"]",
        "rating": 20.0
    },
    {
        "name": "Jeannette Washington",
        "email": "bearlyarticulating@gmail.com",
        "avatar": "https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/35287/jeannette-1__1_.jpg",
        "bio": "I am Jeannette Washington, M.Ed. a former Speech Language Pathologist with nearly a decade of experience working with students that exhibit special abilities. My expertise in the field of dyslexia has been solicited in The Washington Post alongside the cofounder of the Yale Center for Dyslexia & Creativity. Learning to code has ignited my passion for special populations in the tech industry. I have spoken at the Mississippi Dyslexia Symposium, A11y Camp Chicago and participated on a Diversity in WordPress Panel, to name a few. I can always be found tinkering or boasting the importance of accessibility, inclusivity, cognitive diversity and equity in the tech industry.",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "Your Special Abilities and Python",
        "Schedule": "",
        "Category": "Community",
        "Language": "English",
        "abstract": "The most unstoppable programmers have been in a situation where a system has gone down or their code broke, and they were responsible for getting it back up. Their resilience can almost always be attributed to their special abilities.",
        "description": "A high incident of dyslexia and ADHD traits are found in computer programmers. With today's ever-changing technology-reliant world, join me for an all hands on deck \"Think Aloud\" conversation about special abilities such as dyslexia and ADHD. With that in mind, let's steer the strengths, park the misconceptions and drive the tech hacks meant to empower programmers who exhibit special abilities.",
        "audience_level": "All",
        "tags": "[\"best practices\", \"accessibility\", \"diversity\", \"inclusion\", \"community and culture\", \"dyslexia\", \"web development\", \"python\"]",
        "rating": 0.0
    },
    {
        "name": "Jeremy Meiss",
        "email": "Jeremy.Meiss@gmail.com",
        "avatar": "https://secure.gravatar.com/avatar/89ab857b2d58015b13ca239c3a277fb1?s=500",
        "bio": "Jeremy is the Head of Community at Auth0 and former Director of DevRel/Community at XDA-Developers. He is a lover of all things coffee, community, open source, and tech. He has a wife, 3 kids, and a beagle who all profess undying love.",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "Introduction to Identity and Its Uses in Modern Apps",
        "Schedule": "",
        "Category": "Web Dev",
        "Language": "English",
        "abstract": "Digital identity is at the core of any application - invisible yet crucial. We often take identity for granted as most of its magic happens behind the scenes - but it plays a much larger role beyond the login screen for your applications.",
        "description": "Digital identity is at the core of any application - invisible yet crucial. We often take identity for granted as most of its magic happens behind the scenes. But identity plays a much larger role beyond the login screen for your applications. In this talk we'll explore what identity looks like and the importance of getting it right the first time.",
        "audience_level": "All",
        "tags": "[\"identity\", \"authentication\", \"software development\", \"application development\"]",
        "rating": 21.0
    },
    {
        "name": "Jessica Garson",
        "email": "jessica.garson@gmail.com",
        "avatar": "https://secure.gravatar.com/avatar/fb81bde5fa81672ea73df7624e82dc0c?s=500",
        "bio": "Jessica Garson is a Adjunct Professor at NYU. She's also the organizer of the Tech Lady Hackathon, Crack the Code, and previously the organizer of Hack && Tell DC. She is a frequent teacher at DC's Hear Me Code, beginner friendly classes for women by women and has run programming classes at DC area public libraries. Jessica also runs a self-published programming magazine called What's my Function. In 2015, she was named by DC FemTech as one of the most powerful Women in Tech. In 2017, one of her projects nominateher.org got named best web/mobile product of the year by technical.ly magazine. Previously she's worked at ISL, Burson-Marstellar, The National Education Association, ISSI Data, and Salsa Labs. Before working in technology, Jessica worked on numerous campaigns throughout the country and got her degree in Political Science at the University of Hartford.",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "How to Make Music With Python and FoxDot",
        "Schedule": "",
        "Category": "Misc",
        "Language": "English",
        "abstract": "Learn how to make music with Python and FoxDot. We'll go through how to make a song in this live coded adventure. This talk is well suited for all audiences.",
        "description": "This talk will start out with what is FoxDot and how to learn how FoxDot. From there we will walk through the construction of a song using FoxDot, from there we will go into what makes a song. This should provide something for individuals of all levels due to the live coding nature of this talk. Since making music with Python is something that beginner programmers can start with and advanced audiences could find interacting with Python in this way meaningful.\n\nThis talk will be live coded using the Python. There will also some slides that will be available on my website website.com/Making-Music-with-Python. All code samples will also be up on my GitHub.\n",
        "audience_level": "All",
        "tags": "[\"LiveCode\", \"Python\"]",
        "rating": 0.0
    },
    {
        "name": "Jessie Hedges",
        "email": "jessicalhedges@gmail.com",
        "avatar": "/img/speakers/jessie-hedges.jpg",
        "bio": "Jessie Hedges is a software developer at the Software Engineering Institute of Carnegie Mellon University and has 9 years of professional experience. Jessie has Bachelor's degrees in both Psychology and Computer Science from the University of Pittsburgh, and a Masters degree in Information Technology with a focus in Software Design and Management from Carnegie Mellon University. An avid believer in baking empathy in, Jessie tries to find ways to integrate this into software design, leading projects, onboarding and mentoring and process improvement. Jessie also serves on staff council for the university, using advocacy and community involvement to improve the staff experience for all people. Most recently, she has worked with other staff on drafting an inclusive parental leave policy proposal for all staff. When she's not working, she enjoys spending time with her dog, relaxing with a sheet mask, knitting, and practicing hygge in Pittsburgh's cold winter months.\n",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "Mental Health and Tech Shops",
        "Schedule": "",
        "Category": "Business",
        "Language": "English",
        "abstract": "It's easy to overcommit yourself in this industry- open source projects, conference planning and prep, tech meetups and our day job can suck up our time and energy. This talk aims to provide guidance around finding balance, coping mechanisms, and self care for those of us who do too much.",
        "description": "It's easy to overcommit yourself in this industry- open source projects, conference planning and prep, tech meetups and our day job can take up a lot of our time and energy. There are so many \"good\" opportunities and projects to get involved in. But soon we find ourselves having too much of a good thing, and burnout follows. Sometimes we don't even realize we are overworking ourselves, because we've normalized that level of stress in our lives. How do we find a sustainable pace? This talk aims to provide guidance around finding balance, identifying stress and mental health concerns around burnout, and self care for those of us who do too much.",
        "audience_level": "All",
        "tags": "[\"career development\", \"culture\", \"burnout\", \"software development\"]",
        "rating": 21.0
    },
    {
        "name": "Jessie Hedges",
        "email": "jessicalhedges@gmail.com",
        "avatar": "/img/speakers/jessie-hedges.jpg",
        "bio": "Jessie Hedges is a software developer at the Software Engineering Institute of Carnegie Mellon University and has 9 years of professional experience. Jessie has Bachelor's degrees in both Psychology and Computer Science from the University of Pittsburgh, and a Masters degree in Information Technology with a focus in Software Design and Management from Carnegie Mellon University. An avid believer in baking empathy in, Jessie tries to find ways to integrate this into software design, leading projects, onboarding and mentoring and process improvement. Jessie also serves on staff council for the university, using advocacy and community involvement to improve the staff experience for all people. Most recently, she has worked with other staff on drafting an inclusive parental leave policy proposal for all staff. When she's not working, she enjoys spending time with her dog, relaxing with a sheet mask, knitting, and practicing hygge in Pittsburgh's cold winter months.\n",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "Find Your Culture Fit",
        "Schedule": "",
        "Category": "Business",
        "Language": "English",
        "abstract": "Attendees will learn about ways to evaluate companies and teams for a healthy and inclusive culture, through their own research or the interview process. This is a career development talk, aimed at women and underrepresented groups in tech.",
        "description": "Finding your next job can be a nerve-wracking process for many reasons. How do I evaluate a job offer for fairness and culture fit? Does this company have policies and offer benefits that are inclusive? Will I have the support and mentorship I need to advance my career? Will I be treated fairly with respect to promotions and opportunities? These are important topics to many of us who want to succeed in an industry whose prevailing demographics leave us underrepresented, \n\nObjectives:\n* Present the current challenges women and other underrepresented groups face in the industry at all levels.\n* Describe the visible indicators of companies that value and measure diversity and inclusion efforts.\n* Discuss tactics and resources a job seeker can use to research a company's culture.\n* Present examples of questions a job seeker can ask during the interview process, and learn how to evaluate common answers.\n* Present ideas on how to be a better ally in the workplace to those in underrepresented groups.",
        "audience_level": "All",
        "tags": "[\"career\", \"D&I\", \"Diversity\", \"Inclusion\", \"Women in Tech\", \"Culture\"]",
        "rating": 20.0
    },
    {
        "name": "Jessie Hedges",
        "email": "jessicalhedges@gmail.com",
        "avatar": "/img/speakers/jessie-hedges.jpg",
        "bio": "Jessie Hedges is a software developer at the Software Engineering Institute of Carnegie Mellon University and has 9 years of professional experience. Jessie has Bachelor's degrees in both Psychology and Computer Science from the University of Pittsburgh, and a Masters degree in Information Technology with a focus in Software Design and Management from Carnegie Mellon University. An avid believer in baking empathy in, Jessie tries to find ways to integrate this into software design, leading projects, onboarding and mentoring and process improvement. Jessie also serves on staff council for the university, using advocacy and community involvement to improve the staff experience for all people. Most recently, she has worked with other staff on drafting an inclusive parental leave policy proposal for all staff. When she's not working, she enjoys spending time with her dog, relaxing with a sheet mask, knitting, and practicing hygge in Pittsburgh's cold winter months.\n",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "Show Your Work",
        "Schedule": "",
        "Category": "Community",
        "Language": "English",
        "abstract": "This is a career development talk about how to gain visibility into your work, specifically for women in tech. It aims to help attendees by providing guidance on reporting accomplishments and activities, so that supervisors, potential mentors, and colleagues can see the value and effort you provide.",
        "description": "In the workplace, sometimes we may feel that if our work is good, it will speak for itself, relieving us of that responsibility. However for women, research shows that even if the work speaks for itself, the credit is less likely to be given to us. So how do we get the credit for our good work against these challenges? How do we break through unconscious bias, and socialized silence? How can we be our own advocates?\n\nIn this presentation, attendees will hear several strategies for showing your work- tracking your own progress and contribution, and making it visible to those who make decisions about your future. How do you capture and take credit for the emotional and mental labor tasks of your office or project? How do you capture and take credit for the work you do that enables someone else's success? How do you report incremental progress when you are feeling stuck on an issue? All of the work you do, whether it is strictly tangible or not, is work, and should be valued as such. Learning how to report your activities and accomplishments is an important skill, because let's face it- nobody knows the work you do better than you! \n",
        "audience_level": "All",
        "tags": "[\"culture\", \"career development\", \"women in tech\"]",
        "rating": 0.0
    },
    {
        "name": "Karen Miller",
        "email": "karenmil@andrew.cmu.edu",
        "avatar": "https://secure.gravatar.com/avatar/43039f0cb6447f44a40cf24defc2b922?s=500",
        "bio": "Karen D. Miller is a recent Carnegie Mellon University graduate from the Information Security, M.S. program and currently works full-time as an Associate Cyber Security Engineer at the Software Engineering Institute. Karen received a Bachelor of Science degree in Computer Science from Southern Utah University where she frequently participated in cyber defense and capture the flag competitions which fully sparked her interest in penetration testing as a career. Because of her interest in security and government work, Karen chose to pursue her Master's degree through the Scholarship for Service program at CMU instead of moving into a full-time job after graduating from SUU. Although still early in her career, Karen wishes to help others identify paths which align with their goals and how to effectively achieve those goals, which can be exciting, intimidating, and life-changing all at once.",
        "talk_format": "Lightning Talk (~5-10 minutes)",
        "title": "How to Hack (Legally): Python Edition",
        "Schedule": "",
        "Category": "Security",
        "Language": "English",
        "abstract": "When it comes to hacking, trainees are at risk of legal implications and developing bad habits. In this lightning talk, I aim to provide an overview of best practices and trusted resources available to attendees who wish to develop penetration testing skills safely, with an emphasis on Python.",
        "description": "# How to Hack (Legally): Python Edition\n\n## Abstract\n\nPeople often emphasize that the best way to learn is by doing, but when it comes to hacking, the trainee is at risk of legal implications and developing bad habits instead of following ethical procedures. Many people wishing to develop penetration testing skills are unaware of the number of resources available to them to set up a controlled environment where they can legally test hacking tools and techniques.\n\nIn this lightning talk, I will briefly cover a wide range of resources available to attendees, and how they can be used as learning tools. The resources I will cover include pre-built vulnerable virtual machines and web applications, open source tools that can be used in conjunction with Python for discovery/enumeration/exploitation, competitions and challenges, trainings geared towards hacking with Python, and certifications.\n\nI will also outline general safe practices to ensure attendees understand what is and isn't legal, and the consequences of not staying within ethical boundaries. During the talk, a link will be displayed so that participants can easily save a list of the resources outlined in this talk with additional information to reference later.\n\n## Objectives\n\n- Provide an ongoing centralized repository for helpful resources to promote safe and legal hacking\n- Outline general safe hacking practices to create awareness of what is acceptable and what could result in legal implications\n- Share trusted sources of vulnerable targets which can be used to build a home lab for penetration testing with Python\n- Introduce sources of vetted Python exploits and how to test them while discouraging the use of unknown/untrusted exploits\n- Provide a list of trusted open source tools what can be used for recon, scanning, and exploitation within a home lab\n- Discuss valuable trainings that can be pursued to develop Python hacking skills and potentially obtain certifications\n- Describe the benefits of participating in hacking competitions and challenges, either individually or on a team\n\n## Resource Sample\n\nBelow is a small sample of some of the resources that will be included in the repository and discussed in the lightning talk.\n\n- Vulnerable machines: Vulnhub, Metasploitable\n- Vulnerable web applications: DVWA, bWAPP, XVWA, various OWASP apps/VMs\n- Penetration testing tools: Kali Linux, exploit-db, pypcap, scapy\n- Training/certifications: OSCP, CEH, SANS GPEN, HackerSploit\n- Competitions/challenges: picoCTF, pwnable, MITRE CTF\n",
        "audience_level": "All",
        "tags": "[\"Python\", \"Penetration testing\", \"Hacking\", \"Ethical hacking\", \"Pen testing\"]",
        "rating": 20.0
    },
    {
        "name": "Kojo Idrissa",
        "email": "kojo.idrissa@gmail.com",
        "avatar": "https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/12002/IMG_7131.JPG",
        "bio": "Kojo Idrissa *was* an accountant who got an MBA and taught at university in two different countries. He's *now* a software engineer, international tech conference speaker and the [DEFNA](https://www.defna.org/) North American Ambassador ([#NorAmGT](https://twitter.com/search?q=%23NorAmGT&src=tyah)). He's spoken at tech conferences about spreadsheets, contributing to tech communities, Dungeons & Dragons, inclusion and privilege. You can find him online at http://kojoidrissa.com/ or as [@transition](https://twitter.com/Transition) on Twitter.\n",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "A Tale of Two Pythons: Growing Contribution Through Coding Inclusion",
        "Schedule": "",
        "Category": "Culture",
        "Language": "English",
        "abstract": "Starting as a scripting language, Python is now used heavily for software engineering. But the growth of data science, along with Python's accessibility, brings an influx of new community members w/ no desire to be software engineers. How do we best support & embrace our potential new contributors?",
        "description": "In this talk I'll look at people joining our community who aspire to do two different, yet equally valid, styles of coding:\n\n- Programming: *people writing code alone, for themselves, that's meant to run on their own machines, under their supervision* \n- Software Engineering: *people writing code in teams, meant to be run on other people's machines, without supervision*\n\nIncreases in computing power, dropping computer prices and the rise of data science have all led to an increase in people using Python for the \"Programming\" style of code. Yet our community often points to Professional Software Engineering as the \"proper\" way to code. I'll demonstrate that these styles can both be done with basic or advanced Python. After that, I'll look at practices that may benefit one, but not the other, discuss when there may be shifts between the two, and examine how we as existing community members can help guide new members down the path that best fits their goals. This maximizes their chance for success and our chance to add new contributors to our community. Let's not forget: Python is a FLOSS project. We need all the help we can get. This is especially true now that our BDFL has stepped down.\n\nRemember, all software engineers are programmers, but all programmers don't need to be software engineers. But some programmers may become software engineers.",
        "audience_level": "All",
        "tags": "[\"community and culture\", \"data science\", \"software engineering\"]",
        "rating": 21.0
    },
    {
        "name": "Lisibonny Beato",
        "email": "le.beato@ce.pucmm.edu.do",
        "avatar": "/img/speakers/lisibonny-beato.jpg",
        "bio": "Graduada de la carrera de Ingeniería de Sistemas y Computación con un Máster en Tecnologías de la Información en la Universidad Politécnica de Madrid. Actualmente cursando un Doctorado en Tecnologías para el Desarrollo de Sistemas Software Complejos enfocada en NLP y Opinion Mining sobre textos de Microblogs. Profesora-Investigadora de la PUCMM.\n\nAmante de la tecnología, la cocina y de conocer el mundo.",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "Procesamiento de Lenguaje Natural con Python: un vistazo a las librerias NLTK y Pattern",
        "Schedule": "",
        "Category": "AI",
        "Language": "Spanish",
        "abstract": "El NLP es un campo de la ciencias de la computación con gran auge, dada las importantes aplicaciones que tiene en la era de la Web 2.0. En esta charla veremos las librerías NLTK y Pattern de Python para abordar tareas de NLP mediante un enfoque muy práctico, tanto para inglés como para español.",
        "description": "El Procesamiento de Lenguaje Natural (NLP, por sus siglas en inglés) se refiere a la manipulación del lenguaje mediante el uso de computadoras y el objetivo es encontrar mecanismos eficaces para la comunicación entre los humanos y las maquinas mediante el uso del lenguaje natural. El NLP es una confluencia de distintas disciplinas tales como las Ciencias de la Computación, la lingüística, la estadística, entre otras. Con la explosión que ha sucedido en los últimos años en la generación de datos textuales que son almacenados en medios electrónicos gracias a las Redes Sociales y a otras plataformas, esta área se ha convertido en una de mucho interés. Tareas como la traducción automática de textos, la clasificación de textos con distintos fines (filtrado de spam, categorización de documentos por tópicos, análisis de sentimientos, entre otros ), la recuperación de información, el entendimiento y generación de lenguaje natural (para el diseño de Bots, por ejemplo, la extracción de información y los correctores automáticos son solo algunos ejemplos de las aplicaciones que tiene este campo.\n\nPython, por su naturaleza, es un lenguaje poderosísimo para trabajar con texto escrito. En esta charla proponemos dar un vistazo a las principales tareas de NLP y específicamente mostrar de manera práctica y mediante la librería NLTK de Python como estas tareas pueden acometerse para el idioma inglés. Del mismo modo, mostraremos la librería Pattern, la cual permite también hacer NLP en Python pero con un mayor número de recursos disponibles para el idioma español.",
        "audience_level": "Beginner",
        "tags": "[\"NLP\", \"Python\", \"NLTK\", \"Pattern Library\"]",
        "rating": 0.0
    },
    {
        "name": "Luka Sterbic",
        "email": "luka.sterbic@gmail.com",
        "avatar": "https://secure.gravatar.com/avatar/5df702cfb54b2c2acd6a2e9e1a67aac5?s=500",
        "bio": "## Bio\nLuka Steric is a Software Engineer at Facebook. He joined the London office in 2016 after receiving his Master's Degree in Computer Science from the University of Zagreb, Croatia. During his time in university his focus was mainly on bioinformatics, especially next-gen DNA sequence assemblers. Before joining Facebook he interned at the Genome Institute of Singapore and at the International Monetary Fund in Washington DC. He is now part of the Dumont team and works on automated x-repo testing, scenario verification and product monitoring. He is also an Open Source contributor to various Python projects like Typeshed and Black.\n\n",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "Why you should care about types: Python Typing in the Facebook Backend",
        "Schedule": "",
        "Category": "Python",
        "Language": "English",
        "abstract": "By now you have probably all heard about Python static typing. But why should you care? Are types in Python even Pythonic? Is Python turning into Java? In this talk I'll try to answer these questions and explain how type annotations helped scale my team 4x and make new hires happier.",
        "description": "By now you have probably all heard about Python static typing. But why should you care? Are types in Python even Pythonic? Is Python turning into Java? Type annotations are Pythonic, trust Guido's word for it, and Python is definitely not turning into Java.\n\nI joined the Facebook London office in early 2016 after finishing university. At that time my team was running Python 2.7 and we had just 2 engineers. These days we are running 100% typed Python 3.6, have 8 engineers and 3 interns. In 2017 we flipped the switch from 2 to 3 and started aggressively typing the codebase, at that time we had only 3 engs.\n\nIn the first year of the team we managed to hire only 1 eng, the second year 6. So what made the difference? At Facebook, people go through Bootcamp and complete tasks from teams they are interested in before taking a decision on which to join. Having a codebase that's easy to navigate and understand is key to attract talent! Type annotations achieve just that, even without using a type checker.\n\nThe greatest benefit of types in large Python codebases is the fact that the input and output structures of a function are obvious from just looking at the signature. In the untyped world the definition for the class you are looking for may be N jumps away, hidden somewhere deep in the codebase, and you don't have a direct reference to it. In the best possible case grepping for it will yield just a few results and you will be able to spot what you are looking for. In the worst case though, you will have hundreds of hits and you will have to run your application and inspect the type at runtime to figure out what is going on, which make the development cycle slow and tedious.\n\nCome to this talk if you want to know more about the typing system in Python, how to gradually add it to your codebase and what benefits will your team get in the long run! I will also cover FB specific technologies like our runtime type collection system, MonkeyType, and the just open sourced type checker, Pyre!",
        "audience_level": "All",
        "tags": "[\"General Conference\"]",
        "rating": 21.0
    },
    {
        "name": "Matheus Monte",
        "email": "",
        "avatar": "/img/speakers/matheus-monte.jpeg",
        "bio": "I’m matheus monte, Brazilian software developer. Now I’m working on Samsung Institute of Technology, placed on Manaus-AM . I have almost 10 years working on bleed edge technology. Already work to big companies as Nokia, Microsoft, Claro and IBM working with top technologies as JavaScript, C#, C++ and innovate projects . Love to share knowledging with the community and companies though talks and trainnings.",
        "talk_format": "",
        "title": "PyDTN : A framework to build DTN apps using Python",
        "Schedule": "",
        "Category": "IOT",
        "Language": "English",
        "abstract": "",
        "description": "This talk’s goal is about show how to use DTN framework to Python language called PyDTN. DTN is a network protocol communication without physical infrastructure(No internet) and nowdays is used on military communication, space communication and natural disaster areas where the network infrastructure has been compromised",
        "audience_level": "",
        "tags": "",
        "rating": ""
    },
    {
        "name": "Michelle Brenner",
        "email": "mbrenner24@gmail.com",
        "avatar": "https://secure.gravatar.com/avatar/d07a9b0681dbf14ec2744ed12bb6cd17?s=500",
        "bio": "Michelle is a Senior Backend Engineer at ChowNow, helping restaurants to improve their business so they can keep making great food. She has previously served as both an engineer and a manager for the last 7+ years in entertainment technology. She has worked tirelessly to help movies and television get made faster and cheaper, saving productions millions of dollars. A Philadelphia native, she has a background in Media Arts and is a self-taught Python developer. Michelle is now working to give back to her community through mentorship and career training. \n",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "How to use data to get a raise and make your first serverless app",
        "Schedule": "",
        "Category": "Serverless",
        "Language": "English",
        "abstract": "ROI Tracker teaches two skills, how to create your first serverless app and how to track your achievements for the dreaded annual review. I will discuss how best to communicate your successes, the technical advantages of Python based serverless apps and how to get started with your own.",
        "description": "Most people dread the annual review process. It is difficult to remember everything you have done and summarize it in a concise, clear way. As engineers, there is the additional factor of translating technical achievements into a format business folks can understand. I propose a solution for tracking and reporting achievements in a way that's simple and easy for stakeholders to understand.\n\nThis talk will consist of two main parts. After outlining the difficulty of annual reviews with a real life example, I will explain the manual solution of success statements. A success statement is a sentence that explains a single achievement and how it contributes to the bottom line. This is a great place to start, but can be tedious to add up all the information for reports.\n\nThe second part is about the AWS based app I created and how you can use it to store and automatically summarize the data multiple ways. I will explain how serverless apps are a great way for those without DevOps experience to get an app up easily. I'll get into the different ways to manipulate the data and how to deploy the app to have a personal ROI Tracker. The repository is publicly available to make it easy for the attendees to dig in and review the code themselves after the talk.\n",
        "audience_level": "Intermediate",
        "tags": "[\"web development\", \"API\", \"aws\", \"serverless\", \"python\", \"best practices\", \"communication\", \"career development\"]",
        "rating": 0.0
    },
    {
        "name": "Norah Klintberg Sakal",
        "email": "norah.klintberg.sakal@gmail.com",
        "avatar": "https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/24469/Norah_Klintberg_Sakal.jpg",
        "bio": "I'm a 30-year-old self-taught data scientist and entrepreneur from Sweden living in San Francisco. Besides from the own startup, I'm working with a research team where we are applying artificial intelligence and machine learning capabilities on biomedical science to solve big health problems. My passion and mission is to use my engineering background in biotechnology to accelerate the development of new technologies that will help doctors to cure, prevent and manage diseases. \n\nI'm eager to show just a how few lines of code can get you a whole application, end-to-end, and I'm passionate about encouraging and inspiring people to come up with new ideas on implementing data science on their own day-to-day problems by sharing my journey.\n",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "Guide to your own artificial intelligence application in 3 easy steps",
        "Schedule": "",
        "Category": "AI",
        "Language": "English",
        "abstract": "What do you think of when you hear artificial intelligence? Perhaps self-driving cars, autonomous robots and Siri, Alexa or Google Home? But it doesn't have to be that complex. You can build a powerful image classification model within a topic that inspires and interests you - with 3 easy steps.",
        "description": "How difficult is it to build an own intelligent application? When you hear artificial intelligence you might think of complex solutions as self-driving cars, autonomous drones and robots or smart assistants as Alexa or Siri - but it doesn't have to be that complex. You can build a powerful image classification model within a topic that inspires and interests you - with 3 easy steps. First, find a topic that interests you; it can be something that inspires you, excites you or a super simple day-to-day problem you're facing. Which of your skills are matching your interests and other topics that excites you? Use that skill set to the next step, which is creating your own data.\n\nMy day-to-day repetitive problem was the daily makeup routine; it takes time and its quite uninspiring but when you finally decide to try something new - you literally get over 30 million results when search for makeup tutorial on Youtube and beauty being a $400 billion industry indicates that makeup play a significant part of people's lives. How do you even know what makeup style will look as good on you as it does on all the YouTubers?\n\nTherefore I built my very first machine learning algorithm which tells you which eye shape you have and suggests makeup styles matching your particular eye shape to enhances your features. You just snap a photo of your eyes in the app and the algorithm does the rest; telling you which eye shape you have and what makeup style that suits your particular eye shape. I build this app with 3 easy steps and I'm excited to show how you can build yourself an own powerful image classification model, with your own data, within a topic that inspires and interests you. It might sound difficult but I can't wait to show you how few lines of Python you need to build the whole app.\n\nThis talk is for machine learning beginners - by a beginner: I built this classification model with very little experience and the emphasis of this talk is to inform that it is possible to get state of the art results on niches which lack data and that it still exists low having fruits in numerous verticals.\n\nThe essence of the talk is to encourage and inspire to implement data science on niches and verticals that aligns with your own interests.\n\nWhat repetitive and categorizing tasks are you regularly facing? Bring your interests, passion and everyday problems and we'll explore a concrete and more widespread adoption of artificial intelligence solutions.",
        "audience_level": "Beginner",
        "tags": "[\"artificial intelligence\", \"ai\", \"image classification\", \"data science\", \"biotechnology\", \"convolutional neural networks\", \"entrepreneur\", \"python\", \"machine learning\", \"image recognition\", \"transfer learning\", \"deep learning\", \"computer vision\"]",
        "rating": 81.0
    },
    {
        "name": "Ordanis Sanchez",
        "email": "ordanisanchez@gmail.com",
        "avatar": "/img/speakers/ordanis-sanchez.jpeg",
        "bio": "I came from another field, didn't had enough money to go to college for a CS Bachelor so I started learning to programme on my own, been python my first programing language, it was a great decision and keep being great. I had worked on many projects (QA automatization, Web development, Scraping, DL, etc ...) learning a lot throw out my journey. Nowadays I work as Air Traffic Controller on Punta Cana Airport, Web developer for the Instituto Dominicano de Aviacion Civil and Consultant for another company.",
        "talk_format": "Workshop (> 60 minutes)",
        "title": "Lets build an async web framework!",
        "Schedule": "",
        "Category": "Web Dev",
        "Language": "English",
        "abstract": "Reinventing the wheel is great if your goal is to learn more about wheels - James Tauber\n\nAsyncIO has driven the development of new web frameworks in python (Channels, Sanic, ...). But we rarely stop to think about what these tools are doing under the hood. Let us dive into ASGI and build our own.",
        "description": "In this hands-on tutorial, you'll gain a deeper understanding of how async web frameworks work by implementing your own from scratch.\nWe'll build a minimalistic one that handles the ASGI (Asynchronous Server Gateway Interface) request/response cycle, routing, controllers, (options for templates and data layer, web sockets). Along the way, you'll gain a deeper understanding of the decisions web frameworks make, inner workings, the difference between WSGI and ASGI and the why of this.\n\n",
        "audience_level": "Intermediate",
        "tags": "[\"asyncio\", \"webframeworks\", \"python3.6\"]",
        "rating": 20.0
    },
    {
        "name": "Oscar Cortez",
        "email": "om.cortez.2010@gmail.com",
        "avatar": "https://secure.gravatar.com/avatar/a5dc32eefba4ac91ac3bf4745def9559?s=500",
        "bio": "Hi, I'm Oscar! a full-stack web developer based in Nicaragua who's love building blazingly fast and elegant sites using Python, Django, and the \"cool kids\" frontend libraries. During my short career I had the chance to do extensive work in the fields of journalism, open data, machine learning, and education. When I'm not coding, I'm helping other people make unbelievably cool stuff via local meetups or mentorship.",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "Modern Python packaging without pain",
        "Schedule": "",
        "Category": "Tooling",
        "Language": "English",
        "abstract": "The point of this presentation is to explain how to use tools which are all there, waiting to make developing, testing, and distributing our Python packages easier. Doesn't matter if you're a Python expert or a beginner, the knowledge covered by this presentation will be useful despite your level.",
        "description": "PyPI is an incredibly important piece of infrastructure for the Python community, and if you use Python you probably use PyPI, directly or indirectly, on a daily basis, and many different sites, services, and companies rely heavily on it.\n\nCode reuse is a very common need. It saves you time for writing the same code multiple times, it helps organize code in a modular way and enables leveraging other smart people's work to make new things happen. When it comes to python, unfortunately the term \"package\" is an overloaded term, as it means both a noun for a namespace that you put modules into as well as the verb of bundling up some code for easy distribution. Historically, Python packaging has been a source of significant pain for even the most devoted Python enthusiasts.\n\nIn this talk I'll be covering all the required instructions and a quick overview of the current state of Python packaging tools. I'll mostly focus on setuptools, pip and wheels, putting an emphasis on their superiority over their precursors. I'll also list down the honorable mentions of tools worth knowing. Then I'll share examples of how you can use the features of the Setuptools library, we'll go from nothing to a package that you can proudly put it in your portfolio to be used by other people. \n\nAnd yeah! \nWithout pain!",
        "audience_level": "All",
        "tags": "[\"Python\", \"Packaging\", \"PyPI\"]",
        "rating": 80.0
    },
    {
        "name": "Raul Roa",
        "email": "raul.roa@gmail.com",
        "avatar": "/img/speakers/raul-roa.jpg",
        "bio": "I'm a Magic Engineer at TagShelf. I work designing Machine Learning models and applications for the real world, allowing regular people to do super hero things.",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "Person of Interest (WIP)",
        "Schedule": "",
        "Category": "AI",
        "Language": "English",
        "abstract": "I'll be demonstrating how you can use freely available data in social media to create a psych profile for a person. As part of the demonstration I'll then use this as a parameter for an autonomous drone to follow someone who meets specific personality traits.",
        "description": "Text is full of hints that define someones personality. A lot of research has been made to put this information in good use, such as identification of disorders, depression etc. In addition, in commercial scenarios, personality information is useful for ad micro-targeting.",
        "audience_level": "All",
        "tags": "[]",
        "rating": 20.0
    },
    {
        "name": "Rivo Laks",
        "email": "code@rivolaks.com",
        "avatar": "/img/speakers/rivo-laks.jpg",
        "bio": "Rivo is an experienced software developer and systems architect.\n\nHe has mainly worked with Python and Django since 2011 and is also interested in Docker, React and many other technologies surrounding web development.\n\nCurrently on sabbatical, Rivo was last employed as lead engineer at Thorgate, working on a variety of projects involving forestry, smart streetlights, and more.\n",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "Why Machine Learning isn't Scary",
        "Schedule": "",
        "Category": "AI",
        "Language": "English",
        "abstract": "Machine Learning has become hugely popular, but there's a steep learning curve due to the amount of theory and math involved... right?\nNot really! This talk shows that getting started with ML is easier than ever before, shares tips to get started and encourages everyone interested to give it a try.",
        "description": "Machine Learning (ML) is often seen as somewhat intimidating and difficult subject if one doesn't have previous exposure to math, statistics, probability, numeric analysis, and similar topics. Unfortunately this leads to many people never trying it, while the world is in need of more ML engineers.\n\nThis talk aims to demonstrate how easy it is to get started with ML and train powerful models that can solve real-world tasks. All this can be done without heavy maths background, by building on the existing technology, pretrained models and community knowledge.\nSimilar to how web frameworks such as Django make application development easier, there are now several popular ML frameworks such as Keras and PyTorch. They free you from low-level math-intensive coding tasks, and instead make it easy to focus on the higher-level aspects of the problems you're trying to solve.\n\nThe author got started with machine learning less than 1 year ago, after years of doing web development with Python and Django. This talk chronicles that journey and hopefully encourages others to try the same.\n",
        "audience_level": "All",
        "tags": "[\"python\", \"pytorch\", \"ml\", \"machine learning\", \"deep learning\"]",
        "rating": 20.0
    },
    {
        "name": "Sai Srirampur",
        "email": "sai@citusdata.com",
        "avatar": "/img/speakers/sai-srirampur.jpg",
        "bio": "Sai Srirampur a.k.a Sai\n->Lead Solutions Engineer and Early Engineer at Citus Data: Helped in architectures for many customer deployments. That is where all the django/python/postgres experience comes from.\n-> Have been playing ping-pong since more than I have been doing Software! ;)\n",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "Scaling multi-tenant apps using the Django ORM and Postgres",
        "Schedule": "",
        "Category": "Web Dev",
        "Language": "English",
        "abstract": "In the real-world there are 10000s of B2B companies. Their app-stack fits the multi-tenant model - each tenant(customer) deals with it's own data. It is super critical to build scalable applications which gives the company leeway to grow as more customers get on-boarded. Let's learn how to do that!",
        "description": "There are a number of data architectures you could use when building a multi-tenant app. Some, such as using one database per customer or one schema per customer. These two options scale to an extent when you have say 10s of tenants. However as you start scaling to hundreds and thousands of tenants, you start running into challenges both from performance and maintenance of tenants perspective.\n\nYou could solve the above problem by adding the notion of tenancy directly into the logic of your SaaS application. How to implement/automate this in Django-ORM is a challenge? We will talk about how to make the django app tenant aware and at a broader level explain how scale out applications that are built on top of Django ORM and follow a multi tenant data model. We'd take postgresql as our database of choice and the logic/implementation can be extended to any other relational databases as well.\n",
        "audience_level": "All",
        "tags": "[\"django\", \"postgres\", \"databases\", \"python\", \"distributed databases\"]",
        "rating": 20.0
    },
    {
        "name": "Sai Vennam",
        "email": "svennam92@gmail.com",
        "avatar": "https://secure.gravatar.com/avatar/9e8c852fc8884c3c6fa3445653f7632b?s=500",
        "bio": "Sai Vennam is a Developer Advocate at IBM with expertise on Node.js, Go, APIs and various platforms like IBM Cloud, Heroku and Azure. He enjoys creating developer-friendly content and samples to showcase the latest and greatest cloud technology. As a hobby, he works on his home automation using Raspberry Pis and serverless technology. His other interests include cooking Indian food, playing guitar, and going to music festivals.",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "Building Serverless APIs for Modern Application Architectures",
        "Schedule": "",
        "Category": "Serverless",
        "Language": "English",
        "abstract": "Serverless seems like a quick and easy way to get started but key considerations must be made when going to production. I'll overview requirements and strategies for using serverless in production.",
        "description": "Serverless platforms are rapidly gaining adoption and for good reason - it's a consumable and cost-effective way to host functions and capabilities. Developers are told they simply need to write code and let the platform take care of the rest. However, it's not always that straight-forward; most applications in production are complex and have restrictions to integrate with legacy systems.\n\nIn this talk, we'll cover the hybrid architectures that result from refactoring existing applications for modern workloads. In addition, we'll consider requirements that developers encounter when going to production like security and analytics for their serverless APIs. We'll tackle how serverless allows you to transform your applications from traditional to modern hybrid architectures.\n",
        "audience_level": "All",
        "tags": "[\"node\", \"hybrid\", \"api gateway\", \"security\"]",
        "rating": 0.0
    },
    {
        "name": "Dave Stokes",
        "email": "david.stokes@oracle.com",
        "avatar": "https://secure.gravatar.com/avatar/c0fe36ac77bf9a0ebe01f0b7844c8e7f?s=500",
        "bio": "Dave Stokes is a MySQL Community Manager for Oracle",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "MySQL 8 -- A New Beginning",
        "Schedule": "",
        "Category": "DB",
        "Language": "English",
        "abstract": "MySQL 5.7 is great but MySQL 8 is a major redesign. It will have a true data dictionary which means you can have millions of tables within a schema. Windowing Functions, CTEs, roles, multi plane character support, and more important changes. Plus learn what happened to MySQL 6 and MySQL 7.",
        "description": "MySQL 8 is a major redesign of the most popular database on the web. it will have a true data dictionary (no more .frm, MYI, or other little files) which means you can have millions of tables within a schema. Windowing Functions and Common Table Expressions are available, multi plane character support (because you need emojis in your data), user roles, more JSON functions, and big optimizer improvements. And there will be a better 'out of the box' user experience. And you will learn what happened to MySQL 6 and MySQL 7.",
        "audience_level": "All",
        "tags": "[\"database\", \"nosql\"]",
        "rating": 20.0
    },
    {
        "name": "Dave Stokes",
        "email": "david.stokes@oracle.com",
        "avatar": "https://secure.gravatar.com/avatar/c0fe36ac77bf9a0ebe01f0b7844c8e7f?s=500",
        "bio": "Dave Stokes is a MySQL Community Manager for Oracle",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "Python and the MySQl X DevAPI",
        "Schedule": "",
        "Category": "Python",
        "Language": "English",
        "abstract": "MySQL can now act as NoSQL Document Database and thanks to the new X Devapi you can use MySQL with having to embed Structured Query Language (SQL) strings into your beautiful code, normalize data, or set up relational tables. So you can code faster and and not worry as your data evolves.",
        "description": "MySQL can now act as NoSQL Document Database and thanks to the new X Devapi you can use MySQL with having to embed Structured Query Language (SQL) strings into your beautiful code, normalize data, or set up relational tables. So you can code faster and and not worry as your data evolves. The API calls follow modern coding designs and is much easier to read for those without SQL skills. Plus see the new MySQL shell that has a built in Python interpreter or to allow you to easily manage your data.",
        "audience_level": "All",
        "tags": "[\"php\", \"mysql\", \"database\", \"databases\", \"open source\", \"nosql\", \"sql\"]",
        "rating": 19.0
    },
    {
        "name": "Timothy Allen",
        "email": "tim@pyphilly.org",
        "avatar": "https://secure.gravatar.com/avatar/658ae7ed330d8fc70df1c173960d27ad?s=500",
        "bio": "Tim joined Wharton Research Data Services in 2008, after working for local companies and starting a few of his own. Having started programming at age six, he is currently an organizer of the Philadelphia Python Users Group, DjangoCon US, and a member of the Python Software Foundation and Django Software Foundation. Tim is an avid hockey fan, was the first person to sell real world items for virtual microcurrency long before Bitcoin, and enjoys beating his head against brick walls (as demonstrated by his passion for coding, cycling in Philadelphia, and never-ending quest to get his cat to behave). A life-long Philadelphia resident, he graduated from the University of Pennsylvania in 1996 with an individualized major, Computer Aided Information Acquisition.",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "Absolutely Awesome Automated APIs",
        "Schedule": "",
        "Category": "Web Dev",
        "Language": "English",
        "abstract": "WRDS at The Wharton School runs an API service with over 60,000 individual endpoints, each with different permissions. See how we do it in an automated fashion with Django! Some of the solutions are elegant, some are ugly, but it works. Much of it is open-sourced, and we're looking to improve them!",
        "description": "Databases are the elephants in the room of modern technology: mature, reliable, sturdy fixtures in the technology world that have served us well for many decades. Databases stay relevant by continuing to reinvent themselves to serve new technologies further up the stack. The latest buzzwords further up that stack are APIs and microservices, so prevalent that it is hard to see a tech advertisement that doesn't mention them. While related to \"the cloud\" and \"big data\", whatever the heck those terms actually mean, APIs and microservices have a slightly less annoying marketing schtick and more concrete relations to relational databases.\n\nBut what do these relations look like in practice? In this talk, Timothy Allen of Wharton Research Data Services will show how his team at The Wharton School has evolved from providing financial data exclusively in SAS data formats to a robust backend powered by PostgreSQL, which allows financial research to happen in many ecosystems: still available in SAS, but also R, Python, Perl, Matlab, Julia, and more. He will present a case study of using Django REST Framework to build an \"API through introspection.\"\n\nThis case study will show how WRDS built a Django web site and RESTful web service by introspecting financial data stored in a PostgreSQL database cluster. The models for the ORM, serializers for the RESTful API, views for presenting the data to a user, filters for refining queries, URL routing, web browsable interface, user token authorization, and permissions, are all handled by introspecting various features of the PostgreSQL database information schema, all with Python.\n\nMany of these components have been open-sourced, such as the ability to export an endpoint as a spreadsheet file (XLSX), and we are hoping to open-source more of it!",
        "audience_level": "Intermediate",
        "tags": "[\"django\", \"postgresql\", \"django-rest-framework\", \"big-data\", \"finance\"]",
        "rating": 20.0
    },
    {
        "name": "Veronica Hanus",
        "email": "vzh@mit.edu",
        "avatar": "/img/speakers/veronica-hanus.jpg",
        "bio": "Before Veronica was a programmer, she was a researcher (she helped pick the Mars Curiosity Rover's landing site!) with an eye for process improvement. As she's taught herself web development, she's brought her research approach from her time at NASA-JPL & MIT into whatever she was learning. She loves exploring the web and teaching, and recently co-taught a PyCon tutorial on using web-scraping and modeling to predict Oscar winners. When she isn't learning how the web can be better for developers, she enjoys blogging, nerding out about documentation, and snuggling as many cats as possible.\n\nPast speaking experience:\n\n**Technical presentations**\n\n* Imagining Colors is Hard: Representing Visual Changes in Version Control, Hacktoberfest NYC 2018 | [slides](https://bit.ly/2C7uNFI) \n* Assisted in teaching Lights Camera Action! Scrape, explore, and model to predict Oscar winners & box office hits tutorial at PyCon 2018 | [description](https://us.pycon.org/2018/schedule/presentation/48/) | [bio](https://us.pycon.org/2018/speaker/profile/337/) | [video](https://www.youtube.com/watch?v=XMtygcrqHqo) | [materials](https://github.com/dhanus/oscars-tutorial/blob/master/Part1-Scraping-Box-Office-Hits.ipynb) |\n* Using Unix to make your time in the terminal better at NYC Women's Work Jelly 2017 | [project page](https://github.com/vzhz/friendly_terminal) |\n* Assisted in teaching Python for Data Science tutorial at Boston Code Camp 27 (2016) | [description](https://www.bostoncodecamp.com/CC26/sessions/details/16421) | [materials](https://github.com/swzCuroverse/BostonCodeCamp26) |\n* Giving Imposter Syndrome the Kick in the Pants It Deserves at NYC Women's Work Jelly 2016 | [slides](https://docs.google.com/presentation/d/18IB_3lKaUcEqShqjqRn62Jc5XGqhevQnfncPPD7cA18/edit) |\n* Workshop LaTeX: Academic Typesetting for Industry at Recurse Center 2015 | [materials](https://github.com/vzhz/LaTeXresources) |\n\n**Teaching experience**\n\n* SAT Writing Instructor for MIT Academic Teaching Initiative 2011-2012\nDeveloped & taught 12-week SAT Writing course • Median 50% showed a 200 point increase during the course • A few students even contacted me as they were writing college entrance essays\n\n* Programming Coach for Bootstrap Afterschool Program 2011-2012\nProvided 1-on-1 and group instruction for 14 middle-school students in creating their own games • Used functional programming (Scheme) and pair programming to teach algebraic concepts (Pythagorean theorem & writing appropriate algebraic functions) and programming concepts (problem solving using the Design Recipe, data types, Boolean logic, conditional branching, functions & variables)\n\n**Research-related presentations/communication**\n\n* Presented findings of safety tests of malfunctioning equipment to lab at MIT Paleomagnetism Laboratory 2012 \n* Presented findings to internal committee / communicated intern project needs to software developer at NASA JPL 2009\n• Led student effort to find rock distributions of landing sites for Curiosity rover • Introduced three students to in-house software for QA element of our project, including reporting procedures, and software process and limitations",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "Git hooked on images and up your documentation game",
        "Schedule": "",
        "Category": "Tooling",
        "Language": "English",
        "abstract": "*Can you remember the difference between two hex color values? Me neither!* Entering visual representations of recent-changes into version control makes review of past changes easier & speeds acclimation to a new web project. Join me for a review of current methods & how to choose the best for you!",
        "description": "*Can you remember the difference between two hex color values? Me neither!* Entering visual representations of recently-changed elements into version control makes review of past changes easier & speeds acclimation to a new web project, especially for visual learners. Surprisingly, methods for including images in your version control aren't standardized and are rarely used outside of large companies, and the rest of us are left checking out every major commit and viewing changes locally! Join me for a review of methods currently in use and discuss the benefits and drawbacks of each. The audience will learn from a survey of tools used by both designers and web developers, what methods are most appropriate for individual projects, & how these methods differ from those used at some of the largest companies (Google, eBay, etc.). Finding a method to track changes in your visual elements will save our future contributors (and future selves!) the pain of having to distinguish #2dc651 (lime green) from #34a34e (darker(!) lime green) and ultimately make our commit histories cleaner and our repos easier to navigate in ways that many of us have never imagined!",
        "audience_level": "All",
        "tags": "[\"Intermediate\", \"Web-development\", \"Improving workflows\", \"Open source\", \"Maintainers & contributors\", \"Learning styles\", \"Design\", \"Python\"]",
        "rating": 81.0
    },
    {
        "name": "Matilda",
        "email": "vihavira@protonmail.com",
        "avatar": "https://secure.gravatar.com/avatar/9d70138638f5871a104f8b1c1674b120?s=500",
        "bio": "Matilda is a trans disabled artist, community organizer, and programmer studying, imagining, and leveraging mathematical, ecological, and social systems for a more just, equitable, and inclusive world. They have organized around racial, disability, climate, and housing justice and are currently a Data Science fellow at The Knowledge House in New York.\n\nThey are interested in p2p networks as a way of allowing communities to protect themselves in the face of hostile forces, be they social, economic, or ecological",
        "talk_format": "Other",
        "title": "P2P, Python, and You!",
        "Schedule": "",
        "Category": "IOT",
        "Language": "Spanish",
        "abstract": "Will peer-to-peer tech help us build better connections and give people(especially marginalized groups) more power? Who knows, but we will discuss it and make something beginner friendly. Come in knowing nothing about p2p tech, come out knowing how to use P2P protocols to make a simple mesh network!",
        "description": "Full talk version:\nI will quickly (10 min) talk about why peer to peer tech could be so important for allowing users to decide what they want in the world, namely its potential to allow people to understand their tools better, control their data while knowing who it will be shared with(and who it won't be shared with), and avoiding predatory power structures. I will then describe(5 min) how the World Wide Web's protocol(HTTP) and the Internet works, and how mesh networking differs from this and allows communities to control the flow of their information. Finally, I will go over how to build a mesh network in Python using Raspberry PIs.\n",
        "audience_level": "Beginner",
        "tags": "[\"web development\", \"fun\", \"API\"]",
        "rating": 0.0
    },
    {
        "name": "Wildin Mota",
        "email": "wildinmota@gmail.com",
        "avatar": "/img/speakers/wildin-mota.jpg",
        "bio": "Hola, Soy Wildin Mota. Tengo 18 años de edad y actualmente trabajo como Python Developer en PibiCloud, aunque para cuando llegue la conferencia seguro sere FullStack, incluso hasta haciendo Machine Learning pero eso no es seguro aun.\n\nSoy un apasionado del software desde los 14 estoy en esete mundo estudiando por mi cuenta mi primera intereaccion programando era usando bat en windows el cual aprendi en un libro de HackXRank, desde que inicie nunca lo he dejado y siempre me e mantenido curioso ya el resto es historia de estudio y consistencia.\n\nA mis 17 vendi mi primer proyecto de software el cual era un sistema de ventas para la Ferreteria Chelo, este lo hice en C# y SQL Server estaba muy emociado y motivado que hasta amanecia programando, lo mas duro que hice fueron 14 horas seguidas bebi un monton de cafe ese dia para poder aguantar tal trabajo.\n\nA los 18 al graduarme de bachiller en mi pueblo que es la Vega me senti arrinconado y con un futuro escrito en la vega solo una universidad da Software y no hay empresas en esta area interesantes, ademas estaba ansioso de un cambio drastico, a los pocos dias me inscribi en el ITLA sin consentimiento de mis padres yo trabajaba como tecnico asi que pude pagar yo mismo el derecho a admision y los viajes a santo domingo para los examenes, yo desde hace tiempo queria trabajar mientras estaba en la universidad era algo que queria bastante pero al inscribirme en el ITLA se convirtio en necesidad porque mis padres no podian pagarlo y yo tampoco queria que lo hicieran porque era algo que yo queria y yo debia proveermelo por mi mismo, es importante notar que yo enviaba CV's a solo una emprea a la vez y esperaba hasta que em dieran respuesta porque me parecia mal el hecho de ser aceptado por mas de una y despues tener que rechazar a alguien que me dio una oprtunidad pero despues de ver que eso no funcionaba y viendo la necesidad de tener ingresos entre a emplea.do y mande CV a diestra y siniestra en todas que yo tuviera las requisitos incluso Instacarro me devolvio el mensaje pero pospuse la entrevista sin saber que era algo que no se viea muy bien y no volvi a tener respuesta :'( al final una empresa me escribio a las pocas horas de mandar la soclitud y otra me llamo al siguiente dia, me enfoque en esas dos. Para no alargr la historia me quede con la primera empresa que es Castillo Software Solutions estaba para un puesto que solo era HTML y CSS algo que no me ponia muy feliz pero yo se que lo convertiria en algo mas con el tiempo pedi a la empresa que me dieran issues en Angular y asi fue, eso me mantuvo con retos por un tiempo pero aun para mi no era suficiente yo queria ser backend developer y tenia que serlo de una.\n\nA mis 9-10 meses trabajando en CastilloSS un amigo me mando una oferta laboral como Python Dev usando Django/Flask y ademas haciendo Angular e Ionic tecnologias que aprendi para CastilloSS es curioso decir que cuando pedi hacer tareas en angular aun no habia visto un curso basico completo de Angular pero me manejaba bastante bien con JS y me desenvolvi bien, terminaba mis tareas a tiempo y me dejaron solo haciendo Angular.\n\nPues consegui el trabajo y senti que una puerta de un monton de posibilidades se abrio ante mi, es que en esta empresa mi jefe es un genio con un monton de experiencia dispuesto a mostrarnos todo e incluso hizo una seria de libros para volverse senior si los entiendes bien, los cuales ya estoy leyendo, me gusta bastante donde trabajo ahora y pienso ir a ayudar en tantas areas com pueda no hay limites.\n\nCorte bastante la historia para no escribir mas XD, lo siento.\n\n",
        "talk_format": "Other",
        "title": "Ser un Programador Profesional antes de la Universidad",
        "Schedule": "",
        "Category": "Community",
        "Language": "Spanish",
        "abstract": "La charla tratara los puntos mas importantes y comunes a la hora de conseguir un trabajo fijo como un desarrollador de software, en un mundo donde la experiencia es casi una ley, dare desde mi experiencia como yo consegui un trabajo como desarrollador siendo autodidacta sin ningun estudio formal...",
        "description": "Si tu meta es trabajar como un programador con solo los conocimientos que estas adquiriendo por ti mismo pues yo te dare una guia de tanto las cosas necesarias que debes saber, que propuestas enviar CV, que mostrar en la entrevista y en general como ser un buen candidato a elegir, ten en cuenta de que necesitas conocimiento de programacion en alguna area, esto no se logra de la noche a la mañana se necesita de mucha practica y estudio, de tener algun lugar acequible de donde aprender no deberia ser evitado pero si no tienes el tiempo o el dinero hay muchos lugares de donde aprender GRATIS en internet que deberias ver y ademas algunas clases on-site aveces no ayudan mucho y si hablamos de la universidad debes esperar para entrar a temas de materia. Esta charla es para los apasionados que no les falta motivacion y que estan dispuesto a tomar este reto que a mi experiencia puede ser un tanto dificil.",
        "audience_level": "Beginner",
        "tags": "[\"python\", \"university\", \"web\", \"self-taught\"]",
        "rating": 0.0
    },
    {
        "name": "Zac Brown",
        "email": "me@yupitszac.com",
        "avatar": "https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/11947/17022097_10206604068179104_6023710202686998005_n.jpg",
        "bio": "Since writing his first line of code at age 9, Zac has been completely fascinated with computers. 14 years later, at age 23 Zac is working on Python, erlang and node based applications at one of the leading VoIP communications companies today. With experience in multiple areas of product development and delivery, Zac brings his years of learning and growing to multiple venues and events across the globe.",
        "talk_format": "Talk (~30-45 minutes)",
        "title": "Easy CI/CD for your Python app using Bitbucket Pipelines",
        "Schedule": "",
        "Category": "Tooling",
        "Language": "English",
        "abstract": "Building your application is the fun part, but delivering your application is equally important. Many engineers lack the additional devops knowledge required to build and maintain a pipeline process using tools like Jenkins, or Bamboo. Bitbucket has saved the day, we'll explore how.",
        "description": "Building your application is the fun part, but delivering your application is equally important. Many engineers lack the additional devops knowledge required to build and maintain a pipeline process using tools like Jenkins, or Bamboo. Bitbucket has saved the day, we'll explore how. \n\nIn this talk, we'll discuss and demonstrate the various options and functionality available to help us easily build, test and deploy our Python applications with just a few lines of yml",
        "audience_level": "Intermediate",
        "tags": "[\"python\", \"bitbucket\", \"ci/cd\", \"pipelines\", \"deployment\", \"devops\"]",
        "rating": 20.0
    }
]